NordicSemiconductor/nrfx/mdk/nrf54lv10a_enga_types.h
/* ERROR @Bit 2 : Write '1' to disable interrupt for event ERROR */
  #define CCM_INTENCLR_ERROR_Pos (2UL)               /*!< Position of ERROR field.                                             */
  #define CCM_INTENCLR_ERROR_Msk (0x1UL << CCM_INTENCLR_ERROR_Pos) /*!< Bit mask of ERROR field.                               */
  #define CCM_INTENCLR_ERROR_Min (0x0UL)             /*!< Min enumerator value of ERROR field.                                 */
  #define CCM_INTENCLR_ERROR_Max (0x1UL)             /*!< Max enumerator value of ERROR field.                                 */
  #define CCM_INTENCLR_ERROR_Clear (0x1UL)           /*!< Disable                                                              */
  #define CCM_INTENCLR_ERROR_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define CCM_INTENCLR_ERROR_Enabled (0x1UL)         /*!< Read: Enabled                                                        */


/* CCM_MACSTATUS: MAC check result */
  #define CCM_MACSTATUS_ResetValue (0x00000000UL)    /*!< Reset value of MACSTATUS register.                                   */

/* MACSTATUS @Bit 0 : The result of the MAC check performed during the previous decryption operation */
  #define CCM_MACSTATUS_MACSTATUS_Pos (0UL)          /*!< Position of MACSTATUS field.                                         */
  #define CCM_MACSTATUS_MACSTATUS_Msk (0x1UL << CCM_MACSTATUS_MACSTATUS_Pos) /*!< Bit mask of MACSTATUS field.                 */
  #define CCM_MACSTATUS_MACSTATUS_Min (0x0UL)        /*!< Min enumerator value of MACSTATUS field.                             */
  #define CCM_MACSTATUS_MACSTATUS_Max (0x1UL)        /*!< Max enumerator value of MACSTATUS field.                             */
  #define CCM_MACSTATUS_MACSTATUS_CheckFailed (0x0UL) /*!< MAC check failed                                                    */
  #define CCM_MACSTATUS_MACSTATUS_CheckPassed (0x1UL) /*!< MAC check passed                                                    */


/* CCM_ERRORSTATUS: Error status */
  #define CCM_ERRORSTATUS_ResetValue (0x00000000UL)  /*!< Reset value of ERRORSTATUS register.                                 */

/* ERRORSTATUS @Bits 0..2 : Error status when the ERROR event is generated */
  #define CCM_ERRORSTATUS_ERRORSTATUS_Pos (0UL)      /*!< Position of ERRORSTATUS field.                                       */
  #define CCM_ERRORSTATUS_ERRORSTATUS_Msk (0x7UL << CCM_ERRORSTATUS_ERRORSTATUS_Pos) /*!< Bit mask of ERRORSTATUS field.       */
  #define CCM_ERRORSTATUS_ERRORSTATUS_Min (0x0UL)    /*!< Min enumerator value of ERRORSTATUS field.                           */
  #define CCM_ERRORSTATUS_ERRORSTATUS_Max (0x4UL)    /*!< Max enumerator value of ERRORSTATUS field.                           */
  #define CCM_ERRORSTATUS_ERRORSTATUS_NoError (0x0UL) /*!< No errors have occurred                                             */
  #define CCM_ERRORSTATUS_ERRORSTATUS_PrematureInptrEnd (0x1UL) /*!< End of INPTR job list before CCM data structure was read. */
  #define CCM_ERRORSTATUS_ERRORSTATUS_PrematureOutptrEnd (0x2UL) /*!< End of OUTPTR job list before CCM data structure was
                                                                      read.*/
  #define CCM_ERRORSTATUS_ERRORSTATUS_EncryptionTooSlow (0x3UL) /*!< Encryption of the unencrypted CCM data structure did not
                                                                     complete in time.*/
  #define CCM_ERRORSTATUS_ERRORSTATUS_DmaError (0x4UL) /*!< Bus error during DMA access.                                       */


/* CCM_ENABLE: Enable */
  #define CCM_ENABLE_ResetValue (0x00000000UL)       /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..1 : Enable or disable CCM */
  #define CCM_ENABLE_ENABLE_Pos (0UL)                /*!< Position of ENABLE field.                                            */
  #define CCM_ENABLE_ENABLE_Msk (0x3UL << CCM_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                                */
  #define CCM_ENABLE_ENABLE_Min (0x0UL)              /*!< Min enumerator value of ENABLE field.                                */
  #define CCM_ENABLE_ENABLE_Max (0x2UL)              /*!< Max enumerator value of ENABLE field.                                */
  #define CCM_ENABLE_ENABLE_Disabled (0x0UL)         /*!< Disable                                                              */
  #define CCM_ENABLE_ENABLE_Enabled (0x2UL)          /*!< Enable                                                               */


/* CCM_MODE: Operation mode */
  #define CCM_MODE_ResetValue (0x00000001UL)         /*!< Reset value of MODE register.                                        */

/* MODE @Bits 0..1 : The mode of operation to be used. The settings in this register apply when the CRYPT task is triggered. */
  #define CCM_MODE_MODE_Pos (0UL)                    /*!< Position of MODE field.                                              */
  #define CCM_MODE_MODE_Msk (0x3UL << CCM_MODE_MODE_Pos) /*!< Bit mask of MODE field.                                          */
  #define CCM_MODE_MODE_Min (0x0UL)                  /*!< Min enumerator value of MODE field.                                  */
  #define CCM_MODE_MODE_Max (0x2UL)                  /*!< Max enumerator value of MODE field.                                  */
  #define CCM_MODE_MODE_Encryption (0x0UL)           /*!< AES CCM packet encryption mode                                       */
  #define CCM_MODE_MODE_Decryption (0x1UL)           /*!< This mode will run CCM decryption in the speed of the DATARATE field.*/
  #define CCM_MODE_MODE_FastDecryption (0x2UL)       /*!< AES CCM decryption mode.                                             */

/* PROTOCOL @Bits 8..9 : Protocol and packet format selection */
  #define CCM_MODE_PROTOCOL_Pos (8UL)                /*!< Position of PROTOCOL field.                                          */
  #define CCM_MODE_PROTOCOL_Msk (0x3UL << CCM_MODE_PROTOCOL_Pos) /*!< Bit mask of PROTOCOL field.                              */
  #define CCM_MODE_PROTOCOL_Min (0x0UL)              /*!< Min enumerator value of PROTOCOL field.                              */
  #define CCM_MODE_PROTOCOL_Max (0x1UL)              /*!< Max enumerator value of PROTOCOL field.                              */
  #define CCM_MODE_PROTOCOL_Ble (0x0UL)              /*!< Bluetooth Low Energy packet format                                   */
  #define CCM_MODE_PROTOCOL_Ieee802154 (0x1UL)       /*!< 802.15.4 packet format                                               */

/* DATARATE @Bits 16..18 : Radio data rate that the CCM shall run synchronous with */
  #define CCM_MODE_DATARATE_Pos (16UL)               /*!< Position of DATARATE field.                                          */
  #define CCM_MODE_DATARATE_Msk (0x7UL << CCM_MODE_DATARATE_Pos) /*!< Bit mask of DATARATE field.                              */
  #define CCM_MODE_DATARATE_Min (0x0UL)              /*!< Min enumerator value of DATARATE field.                              */
  #define CCM_MODE_DATARATE_Max (0x5UL)              /*!< Max enumerator value of DATARATE field.                              */
  #define CCM_MODE_DATARATE_125Kbit (0x0UL)          /*!< 125 Kbps                                                             */
  #define CCM_MODE_DATARATE_250Kbit (0x1UL)          /*!< 250 Kbps                                                             */
  #define CCM_MODE_DATARATE_500Kbit (0x2UL)          /*!< 500 Kbps                                                             */
  #define CCM_MODE_DATARATE_1Mbit (0x3UL)            /*!< 1 Mbps                                                               */
  #define CCM_MODE_DATARATE_2Mbit (0x4UL)            /*!< 2 Mbps                                                               */
  #define CCM_MODE_DATARATE_4Mbit (0x5UL)            /*!< 4 Mbps                                                               */

/* MACLEN @Bits 24..26 : CCM MAC length (bytes) */
  #define CCM_MODE_MACLEN_Pos (24UL)                 /*!< Position of MACLEN field.                                            */
  #define CCM_MODE_MACLEN_Msk (0x7UL << CCM_MODE_MACLEN_Pos) /*!< Bit mask of MACLEN field.                                    */
  #define CCM_MODE_MACLEN_Min (0x0UL)                /*!< Min enumerator value of MACLEN field.                                */
  #define CCM_MODE_MACLEN_Max (0x7UL)                /*!< Max enumerator value of MACLEN field.                                */
  #define CCM_MODE_MACLEN_M0 (0x0UL)                 /*!< M = 0 This is a special case for CCM* where encryption is required but
                                                          not authentication*/
  #define CCM_MODE_MACLEN_M4 (0x1UL)                 /*!< M = 4                                                                */
  #define CCM_MODE_MACLEN_M6 (0x2UL)                 /*!< M = 6                                                                */
  #define CCM_MODE_MACLEN_M8 (0x3UL)                 /*!< M = 8                                                                */
  #define CCM_MODE_MACLEN_M10 (0x4UL)                /*!< M = 10                                                               */
  #define CCM_MODE_MACLEN_M12 (0x5UL)                /*!< M = 12                                                               */
  #define CCM_MODE_MACLEN_M14 (0x6UL)                /*!< M = 14                                                               */
  #define CCM_MODE_MACLEN_M16 (0x7UL)                /*!< M = 16                                                               */


/* CCM_RATEOVERRIDE: Data rate override setting. */
  #define CCM_RATEOVERRIDE_ResetValue (0x00000002UL) /*!< Reset value of RATEOVERRIDE register.                                */

/* RATEOVERRIDE @Bits 0..2 : Data rate override setting. */
  #define CCM_RATEOVERRIDE_RATEOVERRIDE_Pos (0UL)    /*!< Position of RATEOVERRIDE field.                                      */
  #define CCM_RATEOVERRIDE_RATEOVERRIDE_Msk (0x7UL << CCM_RATEOVERRIDE_RATEOVERRIDE_Pos) /*!< Bit mask of RATEOVERRIDE field.  */
  #define CCM_RATEOVERRIDE_RATEOVERRIDE_Min (0x0UL)  /*!< Min enumerator value of RATEOVERRIDE field.                          */
  #define CCM_RATEOVERRIDE_RATEOVERRIDE_Max (0x5UL)  /*!< Max enumerator value of RATEOVERRIDE field.                          */
  #define CCM_RATEOVERRIDE_RATEOVERRIDE_125Kbit (0x0UL) /*!< 125 Kbps                                                          */
  #define CCM_RATEOVERRIDE_RATEOVERRIDE_500Kbit (0x2UL) /*!< 500 Kbps                                                          */
  #define CCM_RATEOVERRIDE_RATEOVERRIDE_1Mbit (0x3UL) /*!< 1 Mbps                                                              */
  #define CCM_RATEOVERRIDE_RATEOVERRIDE_2Mbit (0x4UL) /*!< 2 Mbps                                                              */
  #define CCM_RATEOVERRIDE_RATEOVERRIDE_4Mbit (0x5UL) /*!< 4 Mbps                                                              */


/* CCM_ADATAMASK: CCM adata mask. */
  #define CCM_ADATAMASK_ResetValue (0x000000E3UL)    /*!< Reset value of ADATAMASK register.                                   */

/* ADATAMASK @Bits 0..7 : CCM adata mask. */
  #define CCM_ADATAMASK_ADATAMASK_Pos (0UL)          /*!< Position of ADATAMASK field.                                         */
  #define CCM_ADATAMASK_ADATAMASK_Msk (0xFFUL << CCM_ADATAMASK_ADATAMASK_Pos) /*!< Bit mask of ADATAMASK field.                */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           CLIC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ==================================================== Struct CLIC_CLIC ===================================================== */
/**
  * @brief CLIC [CLIC_CLIC] (unspecified)
  */
typedef struct {
  __IM  uint32_t  CLICCFG;                           /*!< (@ 0x00000000) CLIC configuration.                                   */
  __IM  uint32_t  CLICINFO;                          /*!< (@ 0x00000004) CLIC information.                                     */
  __IM  uint32_t  RESERVED[1022];
  __IOM uint32_t  CLICINT[271];                      /*!< (@ 0x00001000) Interrupt control register for IRQ number [n].        */
} NRF_CLIC_CLIC_Type;                                /*!< Size = 5180 (0x143C)                                                 */

/* CLIC_CLIC_CLICCFG: CLIC configuration. */
  #define CLIC_CLIC_CLICCFG_ResetValue (0x00000011UL) /*!< Reset value of CLICCFG register.                                    */

/* NVBITS @Bit 0 : Selective interrupt hardware vectoring. */
  #define CLIC_CLIC_CLICCFG_NVBITS_Pos (0UL)         /*!< Position of NVBITS field.                                            */
  #define CLIC_CLIC_CLICCFG_NVBITS_Msk (0x1UL << CLIC_CLIC_CLICCFG_NVBITS_Pos) /*!< Bit mask of NVBITS field.                  */
  #define CLIC_CLIC_CLICCFG_NVBITS_Min (0x1UL)       /*!< Min enumerator value of NVBITS field.                                */
  #define CLIC_CLIC_CLICCFG_NVBITS_Max (0x1UL)       /*!< Max enumerator value of NVBITS field.                                */
  #define CLIC_CLIC_CLICCFG_NVBITS_Implemented (0x1UL) /*!< Selective interrupt hardware vectoring is implemented              */

/* NLBITS @Bits 1..4 : Interrupt level encoding. */
  #define CLIC_CLIC_CLICCFG_NLBITS_Pos (1UL)         /*!< Position of NLBITS field.                                            */
  #define CLIC_CLIC_CLICCFG_NLBITS_Msk (0xFUL << CLIC_CLIC_CLICCFG_NLBITS_Pos) /*!< Bit mask of NLBITS field.                  */
  #define CLIC_CLIC_CLICCFG_NLBITS_Min (0x8UL)       /*!< Min enumerator value of NLBITS field.                                */
  #define CLIC_CLIC_CLICCFG_NLBITS_Max (0x8UL)       /*!< Max enumerator value of NLBITS field.                                */
  #define CLIC_CLIC_CLICCFG_NLBITS_Eight (0x8UL)     /*!< 8 bits = interrupt levels encoded in eight bits                      */

