NordicSemiconductor/nrfx/mdk/nrf54lv10a_enga_types.h
/* THRESHOLD @Bits 0..11 : Sets the threshold value for instruction trace cycle counting. */
  #define ETM_TRCCCCTLR_THRESHOLD_Pos (0UL)          /*!< Position of THRESHOLD field.                                         */
  #define ETM_TRCCCCTLR_THRESHOLD_Msk (0xFFFUL << ETM_TRCCCCTLR_THRESHOLD_Pos) /*!< Bit mask of THRESHOLD field.               */
  #define ETM_TRCCCCTLR_THRESHOLD_Min (0x000UL)      /*!< Min value of THRESHOLD field.                                        */
  #define ETM_TRCCCCTLR_THRESHOLD_Max (0x7FFUL)      /*!< Max size of THRESHOLD field.                                         */


/* ETM_TRCBBCTLR: Controls which regions in the memory map are enabled to use branch broadcasting. Might ignore writes when the
                   trace unit is enabled or not idle. Must be programmed if TRCCONFIGR.BB == 1. */

  #define ETM_TRCBBCTLR_ResetValue (0x00000000UL)    /*!< Reset value of TRCBBCTLR register.                                   */

/* RANGE0 @Bit 0 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[0] controls the selection of address range
                   comparator pair 0. */

  #define ETM_TRCBBCTLR_RANGE0_Pos (0UL)             /*!< Position of RANGE0 field.                                            */
  #define ETM_TRCBBCTLR_RANGE0_Msk (0x1UL << ETM_TRCBBCTLR_RANGE0_Pos) /*!< Bit mask of RANGE0 field.                          */
  #define ETM_TRCBBCTLR_RANGE0_Min (0x0UL)           /*!< Min enumerator value of RANGE0 field.                                */
  #define ETM_TRCBBCTLR_RANGE0_Max (0x1UL)           /*!< Max enumerator value of RANGE0 field.                                */
  #define ETM_TRCBBCTLR_RANGE0_Disabled (0x0UL)      /*!< The address range that address range comparator pair 0 defines, is not
                                                          selected.*/
  #define ETM_TRCBBCTLR_RANGE0_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/

/* RANGE1 @Bit 1 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[1] controls the selection of address range
                   comparator pair 1. */

  #define ETM_TRCBBCTLR_RANGE1_Pos (1UL)             /*!< Position of RANGE1 field.                                            */
  #define ETM_TRCBBCTLR_RANGE1_Msk (0x1UL << ETM_TRCBBCTLR_RANGE1_Pos) /*!< Bit mask of RANGE1 field.                          */
  #define ETM_TRCBBCTLR_RANGE1_Min (0x0UL)           /*!< Min enumerator value of RANGE1 field.                                */
  #define ETM_TRCBBCTLR_RANGE1_Max (0x1UL)           /*!< Max enumerator value of RANGE1 field.                                */
  #define ETM_TRCBBCTLR_RANGE1_Disabled (0x0UL)      /*!< The address range that address range comparator pair 1 defines, is not
                                                          selected.*/
  #define ETM_TRCBBCTLR_RANGE1_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/

/* RANGE2 @Bit 2 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[2] controls the selection of address range
                   comparator pair 2. */

  #define ETM_TRCBBCTLR_RANGE2_Pos (2UL)             /*!< Position of RANGE2 field.                                            */
  #define ETM_TRCBBCTLR_RANGE2_Msk (0x1UL << ETM_TRCBBCTLR_RANGE2_Pos) /*!< Bit mask of RANGE2 field.                          */
  #define ETM_TRCBBCTLR_RANGE2_Min (0x0UL)           /*!< Min enumerator value of RANGE2 field.                                */
  #define ETM_TRCBBCTLR_RANGE2_Max (0x1UL)           /*!< Max enumerator value of RANGE2 field.                                */
  #define ETM_TRCBBCTLR_RANGE2_Disabled (0x0UL)      /*!< The address range that address range comparator pair 2 defines, is not
                                                          selected.*/
  #define ETM_TRCBBCTLR_RANGE2_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/

/* RANGE3 @Bit 3 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[3] controls the selection of address range
                   comparator pair 3. */

  #define ETM_TRCBBCTLR_RANGE3_Pos (3UL)             /*!< Position of RANGE3 field.                                            */
  #define ETM_TRCBBCTLR_RANGE3_Msk (0x1UL << ETM_TRCBBCTLR_RANGE3_Pos) /*!< Bit mask of RANGE3 field.                          */
  #define ETM_TRCBBCTLR_RANGE3_Min (0x0UL)           /*!< Min enumerator value of RANGE3 field.                                */
  #define ETM_TRCBBCTLR_RANGE3_Max (0x1UL)           /*!< Max enumerator value of RANGE3 field.                                */
  #define ETM_TRCBBCTLR_RANGE3_Disabled (0x0UL)      /*!< The address range that address range comparator pair 3 defines, is not
                                                          selected.*/
  #define ETM_TRCBBCTLR_RANGE3_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/

/* RANGE4 @Bit 4 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[4] controls the selection of address range
                   comparator pair 4. */

  #define ETM_TRCBBCTLR_RANGE4_Pos (4UL)             /*!< Position of RANGE4 field.                                            */
  #define ETM_TRCBBCTLR_RANGE4_Msk (0x1UL << ETM_TRCBBCTLR_RANGE4_Pos) /*!< Bit mask of RANGE4 field.                          */
  #define ETM_TRCBBCTLR_RANGE4_Min (0x0UL)           /*!< Min enumerator value of RANGE4 field.                                */
  #define ETM_TRCBBCTLR_RANGE4_Max (0x1UL)           /*!< Max enumerator value of RANGE4 field.                                */
  #define ETM_TRCBBCTLR_RANGE4_Disabled (0x0UL)      /*!< The address range that address range comparator pair 4 defines, is not
                                                          selected.*/
  #define ETM_TRCBBCTLR_RANGE4_Enabled (0x1UL)       /*!< The address range that address range comparator pair n defines, is
                                                          selected.*/

/* RANGE5 @Bit 5 : Address range field. Selects which address range comparator pairs are in use with branch broadcasting. Each
                   field represents an address range comparator pair, so field[5] controls the selection of address range
                   comparator pair 5. */

