NordicSemiconductor/nrfx/mdk/nrf54lv10a_enga_types.h
/* EXCLUDE6 @Bit 22 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

  #define ETM_TRCVIIECTLR_EXCLUDE6_Pos (22UL)        /*!< Position of EXCLUDE6 field.                                          */
  #define ETM_TRCVIIECTLR_EXCLUDE6_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE6_Pos) /*!< Bit mask of EXCLUDE6 field.                */
  #define ETM_TRCVIIECTLR_EXCLUDE6_Min (0x0UL)       /*!< Min enumerator value of EXCLUDE6 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE6_Max (0x1UL)       /*!< Max enumerator value of EXCLUDE6 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE6_Disabled (0x0UL)  /*!< The address range that address range comparator pair 6 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE6_Enabled (0x1UL)   /*!< The address range that address range comparator pair 6 defines, is
                                                          selected for ViewInst exclude control.*/

/* EXCLUDE7 @Bit 23 : Exclude range field. Selects which address range comparator pairs are in use with ViewInst exclude
                      control. */

  #define ETM_TRCVIIECTLR_EXCLUDE7_Pos (23UL)        /*!< Position of EXCLUDE7 field.                                          */
  #define ETM_TRCVIIECTLR_EXCLUDE7_Msk (0x1UL << ETM_TRCVIIECTLR_EXCLUDE7_Pos) /*!< Bit mask of EXCLUDE7 field.                */
  #define ETM_TRCVIIECTLR_EXCLUDE7_Min (0x0UL)       /*!< Min enumerator value of EXCLUDE7 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE7_Max (0x1UL)       /*!< Max enumerator value of EXCLUDE7 field.                              */
  #define ETM_TRCVIIECTLR_EXCLUDE7_Disabled (0x0UL)  /*!< The address range that address range comparator pair 7 defines, is not
                                                          selected for ViewInst exclude control.*/
  #define ETM_TRCVIIECTLR_EXCLUDE7_Enabled (0x1UL)   /*!< The address range that address range comparator pair 7 defines, is
                                                          selected for ViewInst exclude control.*/


/* ETM_TRCVISSCTLR: Use this to set, or read, the single address comparators that control the ViewInst start/stop logic. The
                     start/stop logic is active for an instruction which causes a start and remains active up to and including
                     an instruction which causes a stop, and then the start/stop logic becomes inactive. Might ignore writes
                     when the trace unit is enabled or not idle. If implemented then this register must be programmed. */

  #define ETM_TRCVISSCTLR_ResetValue (0x00000000UL)  /*!< Reset value of TRCVISSCTLR register.                                 */

/* START0 @Bit 0 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

  #define ETM_TRCVISSCTLR_START0_Pos (0UL)           /*!< Position of START0 field.                                            */
  #define ETM_TRCVISSCTLR_START0_Msk (0x1UL << ETM_TRCVISSCTLR_START0_Pos) /*!< Bit mask of START0 field.                      */
  #define ETM_TRCVISSCTLR_START0_Min (0x0UL)         /*!< Min enumerator value of START0 field.                                */
  #define ETM_TRCVISSCTLR_START0_Max (0x1UL)         /*!< Max enumerator value of START0 field.                                */
  #define ETM_TRCVISSCTLR_START0_Disabled (0x0UL)    /*!< The single address comparator 0, is not selected as a start resource.*/
  #define ETM_TRCVISSCTLR_START0_Enabled (0x1UL)     /*!< The single address comparator 0, is selected as a start resource.    */

/* START1 @Bit 1 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

  #define ETM_TRCVISSCTLR_START1_Pos (1UL)           /*!< Position of START1 field.                                            */
  #define ETM_TRCVISSCTLR_START1_Msk (0x1UL << ETM_TRCVISSCTLR_START1_Pos) /*!< Bit mask of START1 field.                      */
  #define ETM_TRCVISSCTLR_START1_Min (0x0UL)         /*!< Min enumerator value of START1 field.                                */
  #define ETM_TRCVISSCTLR_START1_Max (0x1UL)         /*!< Max enumerator value of START1 field.                                */
  #define ETM_TRCVISSCTLR_START1_Disabled (0x0UL)    /*!< The single address comparator 1, is not selected as a start resource.*/
  #define ETM_TRCVISSCTLR_START1_Enabled (0x1UL)     /*!< The single address comparator 1, is selected as a start resource.    */

/* START2 @Bit 2 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

  #define ETM_TRCVISSCTLR_START2_Pos (2UL)           /*!< Position of START2 field.                                            */
  #define ETM_TRCVISSCTLR_START2_Msk (0x1UL << ETM_TRCVISSCTLR_START2_Pos) /*!< Bit mask of START2 field.                      */
  #define ETM_TRCVISSCTLR_START2_Min (0x0UL)         /*!< Min enumerator value of START2 field.                                */
  #define ETM_TRCVISSCTLR_START2_Max (0x1UL)         /*!< Max enumerator value of START2 field.                                */
  #define ETM_TRCVISSCTLR_START2_Disabled (0x0UL)    /*!< The single address comparator 2, is not selected as a start resource.*/
  #define ETM_TRCVISSCTLR_START2_Enabled (0x1UL)     /*!< The single address comparator 2, is selected as a start resource.    */

/* START3 @Bit 3 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

  #define ETM_TRCVISSCTLR_START3_Pos (3UL)           /*!< Position of START3 field.                                            */
  #define ETM_TRCVISSCTLR_START3_Msk (0x1UL << ETM_TRCVISSCTLR_START3_Pos) /*!< Bit mask of START3 field.                      */
  #define ETM_TRCVISSCTLR_START3_Min (0x0UL)         /*!< Min enumerator value of START3 field.                                */
  #define ETM_TRCVISSCTLR_START3_Max (0x1UL)         /*!< Max enumerator value of START3 field.                                */
  #define ETM_TRCVISSCTLR_START3_Disabled (0x0UL)    /*!< The single address comparator 3, is not selected as a start resource.*/
  #define ETM_TRCVISSCTLR_START3_Enabled (0x1UL)     /*!< The single address comparator 3, is selected as a start resource.    */

/* START4 @Bit 4 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

  #define ETM_TRCVISSCTLR_START4_Pos (4UL)           /*!< Position of START4 field.                                            */
  #define ETM_TRCVISSCTLR_START4_Msk (0x1UL << ETM_TRCVISSCTLR_START4_Pos) /*!< Bit mask of START4 field.                      */
  #define ETM_TRCVISSCTLR_START4_Min (0x0UL)         /*!< Min enumerator value of START4 field.                                */
  #define ETM_TRCVISSCTLR_START4_Max (0x1UL)         /*!< Max enumerator value of START4 field.                                */
  #define ETM_TRCVISSCTLR_START4_Disabled (0x0UL)    /*!< The single address comparator 4, is not selected as a start resource.*/
  #define ETM_TRCVISSCTLR_START4_Enabled (0x1UL)     /*!< The single address comparator 4, is selected as a start resource.    */

/* START5 @Bit 5 : Selects which single address comparators are in use with ViewInst start/stop control, for the purpose of
                   starting trace. */

  #define ETM_TRCVISSCTLR_START5_Pos (5UL)           /*!< Position of START5 field.                                            */
  #define ETM_TRCVISSCTLR_START5_Msk (0x1UL << ETM_TRCVISSCTLR_START5_Pos) /*!< Bit mask of START5 field.                      */
  #define ETM_TRCVISSCTLR_START5_Min (0x0UL)         /*!< Min enumerator value of START5 field.                                */
  #define ETM_TRCVISSCTLR_START5_Max (0x1UL)         /*!< Max enumerator value of START5 field.                                */
  #define ETM_TRCVISSCTLR_START5_Disabled (0x0UL)    /*!< The single address comparator 5, is not selected as a start resource.*/
  #define ETM_TRCVISSCTLR_START5_Enabled (0x1UL)     /*!< The single address comparator 5, is selected as a start resource.    */

