NordicSemiconductor/nrfx/mdk/nrf54lv10a_enga_types.h
/* ETM_TRCSSCCR0: Controls the single-shot comparator. */
  #define ETM_TRCSSCCR0_ResetValue (0x00000000UL)    /*!< Reset value of TRCSSCCR0 register.                                   */

/* RST @Bit 24 : Enables the single-shot comparator resource to be reset when it occurs, to enable another comparator match to
                 be detected */

  #define ETM_TRCSSCCR0_RST_Pos (24UL)               /*!< Position of RST field.                                               */
  #define ETM_TRCSSCCR0_RST_Msk (0x1UL << ETM_TRCSSCCR0_RST_Pos) /*!< Bit mask of RST field.                                   */
  #define ETM_TRCSSCCR0_RST_Min (0x0UL)              /*!< Min enumerator value of RST field.                                   */
  #define ETM_TRCSSCCR0_RST_Max (0x1UL)              /*!< Max enumerator value of RST field.                                   */
  #define ETM_TRCSSCCR0_RST_Disabled (0x0UL)         /*!< Multiple matches can not be detected.                                */
  #define ETM_TRCSSCCR0_RST_Enabled (0x1UL)          /*!< Multiple matches can occur.                                          */


/* ETM_TRCSSCSR0: Indicates the status of the single-shot comparators. TRCSSCSR0 is sensitive toinstruction addresses. */
  #define ETM_TRCSSCSR0_ResetValue (0x00000000UL)    /*!< Reset value of TRCSSCSR0 register.                                   */

/* INST @Bit 0 : Instruction address comparator support */
  #define ETM_TRCSSCSR0_INST_Pos (0UL)               /*!< Position of INST field.                                              */
  #define ETM_TRCSSCSR0_INST_Msk (0x1UL << ETM_TRCSSCSR0_INST_Pos) /*!< Bit mask of INST field.                                */
  #define ETM_TRCSSCSR0_INST_Min (0x0UL)             /*!< Min enumerator value of INST field.                                  */
  #define ETM_TRCSSCSR0_INST_Max (0x1UL)             /*!< Max enumerator value of INST field.                                  */
  #define ETM_TRCSSCSR0_INST_False (0x0UL)           /*!< Single-shot instruction address comparisons not supported.           */
  #define ETM_TRCSSCSR0_INST_True (0x1UL)            /*!< Single-shot instruction address comparisons supported.               */

/* DA @Bit 1 : Data address comparator support */
  #define ETM_TRCSSCSR0_DA_Pos (1UL)                 /*!< Position of DA field.                                                */
  #define ETM_TRCSSCSR0_DA_Msk (0x1UL << ETM_TRCSSCSR0_DA_Pos) /*!< Bit mask of DA field.                                      */
  #define ETM_TRCSSCSR0_DA_Min (0x0UL)               /*!< Min enumerator value of DA field.                                    */
  #define ETM_TRCSSCSR0_DA_Max (0x1UL)               /*!< Max enumerator value of DA field.                                    */
  #define ETM_TRCSSCSR0_DA_False (0x0UL)             /*!< Data address comparisons not supported.                              */
  #define ETM_TRCSSCSR0_DA_True (0x1UL)              /*!< Data address comparisons supported.                                  */

/* DV @Bit 2 : Data value comparator support */
  #define ETM_TRCSSCSR0_DV_Pos (2UL)                 /*!< Position of DV field.                                                */
  #define ETM_TRCSSCSR0_DV_Msk (0x1UL << ETM_TRCSSCSR0_DV_Pos) /*!< Bit mask of DV field.                                      */
  #define ETM_TRCSSCSR0_DV_Min (0x0UL)               /*!< Min enumerator value of DV field.                                    */
  #define ETM_TRCSSCSR0_DV_Max (0x1UL)               /*!< Max enumerator value of DV field.                                    */
  #define ETM_TRCSSCSR0_DV_False (0x0UL)             /*!< Data value comparisons not supported.                                */
  #define ETM_TRCSSCSR0_DV_True (0x1UL)              /*!< Data value comparisons supported.                                    */

/* PC @Bit 3 : Process counter value comparator support */
  #define ETM_TRCSSCSR0_PC_Pos (3UL)                 /*!< Position of PC field.                                                */
  #define ETM_TRCSSCSR0_PC_Msk (0x1UL << ETM_TRCSSCSR0_PC_Pos) /*!< Bit mask of PC field.                                      */
  #define ETM_TRCSSCSR0_PC_Min (0x0UL)               /*!< Min enumerator value of PC field.                                    */
  #define ETM_TRCSSCSR0_PC_Max (0x1UL)               /*!< Max enumerator value of PC field.                                    */
  #define ETM_TRCSSCSR0_PC_False (0x0UL)             /*!< Process counter value comparisons not supported.                     */
  #define ETM_TRCSSCSR0_PC_True (0x1UL)              /*!< Process counter value comparisons supported.                         */

/* STATUS @Bit 31 : Single-shot status. This indicates whether any of the selected comparators have matched. */
  #define ETM_TRCSSCSR0_STATUS_Pos (31UL)            /*!< Position of STATUS field.                                            */
  #define ETM_TRCSSCSR0_STATUS_Msk (0x1UL << ETM_TRCSSCSR0_STATUS_Pos) /*!< Bit mask of STATUS field.                          */
  #define ETM_TRCSSCSR0_STATUS_Min (0x0UL)           /*!< Min enumerator value of STATUS field.                                */
  #define ETM_TRCSSCSR0_STATUS_Max (0x1UL)           /*!< Max enumerator value of STATUS field.                                */
  #define ETM_TRCSSCSR0_STATUS_NoMatch (0x0UL)       /*!< Match has not occurred.                                              */
  #define ETM_TRCSSCSR0_STATUS_Match (0x1UL)         /*!< Match has occurred at least once.                                    */


/* ETM_TRCSSPCICR0: Selects the processor comparator inputs for Single-shot control. */
  #define ETM_TRCSSPCICR0_ResetValue (0x00000000UL)  /*!< Reset value of TRCSSPCICR0 register.                                 */

/* PC0 @Bit 0 : Selects processor comparator 0 inputs for Single-shot control */
  #define ETM_TRCSSPCICR0_PC0_Pos (0UL)              /*!< Position of PC0 field.                                               */
  #define ETM_TRCSSPCICR0_PC0_Msk (0x1UL << ETM_TRCSSPCICR0_PC0_Pos) /*!< Bit mask of PC0 field.                               */
  #define ETM_TRCSSPCICR0_PC0_Min (0x0UL)            /*!< Min enumerator value of PC0 field.                                   */
  #define ETM_TRCSSPCICR0_PC0_Max (0x1UL)            /*!< Max enumerator value of PC0 field.                                   */
  #define ETM_TRCSSPCICR0_PC0_Disabled (0x0UL)       /*!< Processor comparator 0 is not selected for Single-shot control.      */
  #define ETM_TRCSSPCICR0_PC0_Enabled (0x1UL)        /*!< Processor comparator 0 is selected for Single-shot control.          */

/* PC1 @Bit 1 : Selects processor comparator 1 inputs for Single-shot control */
  #define ETM_TRCSSPCICR0_PC1_Pos (1UL)              /*!< Position of PC1 field.                                               */
  #define ETM_TRCSSPCICR0_PC1_Msk (0x1UL << ETM_TRCSSPCICR0_PC1_Pos) /*!< Bit mask of PC1 field.                               */
  #define ETM_TRCSSPCICR0_PC1_Min (0x0UL)            /*!< Min enumerator value of PC1 field.                                   */
  #define ETM_TRCSSPCICR0_PC1_Max (0x1UL)            /*!< Max enumerator value of PC1 field.                                   */
  #define ETM_TRCSSPCICR0_PC1_Disabled (0x0UL)       /*!< Processor comparator 1 is not selected for Single-shot control.      */
  #define ETM_TRCSSPCICR0_PC1_Enabled (0x1UL)        /*!< Processor comparator 1 is selected for Single-shot control.          */

