NordicSemiconductor/nrfx/mdk/nrf54lv10a_enga_types.h
/* SEND20 @Bit 20 : The status for tasks overflow at SUBSCRIBE_SEND[20]. */
  #define PPIB_OVERFLOW_SEND_SEND20_Pos (20UL)       /*!< Position of SEND20 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND20_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND20_Pos) /*!< Bit mask of SEND20 field.                */
  #define PPIB_OVERFLOW_SEND_SEND20_Min (0x0UL)      /*!< Min enumerator value of SEND20 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND20_Max (0x1UL)      /*!< Max enumerator value of SEND20 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND20_Overflow (0x1UL) /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND20_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                     */

/* SEND21 @Bit 21 : The status for tasks overflow at SUBSCRIBE_SEND[21]. */
  #define PPIB_OVERFLOW_SEND_SEND21_Pos (21UL)       /*!< Position of SEND21 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND21_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND21_Pos) /*!< Bit mask of SEND21 field.                */
  #define PPIB_OVERFLOW_SEND_SEND21_Min (0x0UL)      /*!< Min enumerator value of SEND21 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND21_Max (0x1UL)      /*!< Max enumerator value of SEND21 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND21_Overflow (0x1UL) /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND21_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                     */

/* SEND22 @Bit 22 : The status for tasks overflow at SUBSCRIBE_SEND[22]. */
  #define PPIB_OVERFLOW_SEND_SEND22_Pos (22UL)       /*!< Position of SEND22 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND22_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND22_Pos) /*!< Bit mask of SEND22 field.                */
  #define PPIB_OVERFLOW_SEND_SEND22_Min (0x0UL)      /*!< Min enumerator value of SEND22 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND22_Max (0x1UL)      /*!< Max enumerator value of SEND22 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND22_Overflow (0x1UL) /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND22_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                     */

/* SEND23 @Bit 23 : The status for tasks overflow at SUBSCRIBE_SEND[23]. */
  #define PPIB_OVERFLOW_SEND_SEND23_Pos (23UL)       /*!< Position of SEND23 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND23_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND23_Pos) /*!< Bit mask of SEND23 field.                */
  #define PPIB_OVERFLOW_SEND_SEND23_Min (0x0UL)      /*!< Min enumerator value of SEND23 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND23_Max (0x1UL)      /*!< Max enumerator value of SEND23 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND23_Overflow (0x1UL) /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND23_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                     */

/* SEND24 @Bit 24 : The status for tasks overflow at SUBSCRIBE_SEND[24]. */
  #define PPIB_OVERFLOW_SEND_SEND24_Pos (24UL)       /*!< Position of SEND24 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND24_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND24_Pos) /*!< Bit mask of SEND24 field.                */
  #define PPIB_OVERFLOW_SEND_SEND24_Min (0x0UL)      /*!< Min enumerator value of SEND24 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND24_Max (0x1UL)      /*!< Max enumerator value of SEND24 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND24_Overflow (0x1UL) /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND24_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                     */

/* SEND25 @Bit 25 : The status for tasks overflow at SUBSCRIBE_SEND[25]. */
  #define PPIB_OVERFLOW_SEND_SEND25_Pos (25UL)       /*!< Position of SEND25 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND25_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND25_Pos) /*!< Bit mask of SEND25 field.                */
  #define PPIB_OVERFLOW_SEND_SEND25_Min (0x0UL)      /*!< Min enumerator value of SEND25 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND25_Max (0x1UL)      /*!< Max enumerator value of SEND25 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND25_Overflow (0x1UL) /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND25_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                     */

/* SEND26 @Bit 26 : The status for tasks overflow at SUBSCRIBE_SEND[26]. */
  #define PPIB_OVERFLOW_SEND_SEND26_Pos (26UL)       /*!< Position of SEND26 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND26_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND26_Pos) /*!< Bit mask of SEND26 field.                */
  #define PPIB_OVERFLOW_SEND_SEND26_Min (0x0UL)      /*!< Min enumerator value of SEND26 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND26_Max (0x1UL)      /*!< Max enumerator value of SEND26 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND26_Overflow (0x1UL) /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND26_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                     */

/* SEND27 @Bit 27 : The status for tasks overflow at SUBSCRIBE_SEND[27]. */
  #define PPIB_OVERFLOW_SEND_SEND27_Pos (27UL)       /*!< Position of SEND27 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND27_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND27_Pos) /*!< Bit mask of SEND27 field.                */
  #define PPIB_OVERFLOW_SEND_SEND27_Min (0x0UL)      /*!< Min enumerator value of SEND27 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND27_Max (0x1UL)      /*!< Max enumerator value of SEND27 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND27_Overflow (0x1UL) /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND27_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                     */

/* SEND28 @Bit 28 : The status for tasks overflow at SUBSCRIBE_SEND[28]. */
  #define PPIB_OVERFLOW_SEND_SEND28_Pos (28UL)       /*!< Position of SEND28 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND28_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND28_Pos) /*!< Bit mask of SEND28 field.                */
  #define PPIB_OVERFLOW_SEND_SEND28_Min (0x0UL)      /*!< Min enumerator value of SEND28 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND28_Max (0x1UL)      /*!< Max enumerator value of SEND28 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND28_Overflow (0x1UL) /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND28_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                     */

/* SEND29 @Bit 29 : The status for tasks overflow at SUBSCRIBE_SEND[29]. */
  #define PPIB_OVERFLOW_SEND_SEND29_Pos (29UL)       /*!< Position of SEND29 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND29_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND29_Pos) /*!< Bit mask of SEND29 field.                */
  #define PPIB_OVERFLOW_SEND_SEND29_Min (0x0UL)      /*!< Min enumerator value of SEND29 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND29_Max (0x1UL)      /*!< Max enumerator value of SEND29 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND29_Overflow (0x1UL) /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND29_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                     */

/* SEND30 @Bit 30 : The status for tasks overflow at SUBSCRIBE_SEND[30]. */
  #define PPIB_OVERFLOW_SEND_SEND30_Pos (30UL)       /*!< Position of SEND30 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND30_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND30_Pos) /*!< Bit mask of SEND30 field.                */
  #define PPIB_OVERFLOW_SEND_SEND30_Min (0x0UL)      /*!< Min enumerator value of SEND30 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND30_Max (0x1UL)      /*!< Max enumerator value of SEND30 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND30_Overflow (0x1UL) /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND30_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                     */

/* SEND31 @Bit 31 : The status for tasks overflow at SUBSCRIBE_SEND[31]. */
  #define PPIB_OVERFLOW_SEND_SEND31_Pos (31UL)       /*!< Position of SEND31 field.                                            */
  #define PPIB_OVERFLOW_SEND_SEND31_Msk (0x1UL << PPIB_OVERFLOW_SEND_SEND31_Pos) /*!< Bit mask of SEND31 field.                */
  #define PPIB_OVERFLOW_SEND_SEND31_Min (0x0UL)      /*!< Min enumerator value of SEND31 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND31_Max (0x1UL)      /*!< Max enumerator value of SEND31 field.                                */
  #define PPIB_OVERFLOW_SEND_SEND31_Overflow (0x1UL) /*!< Task overflow is happened.                                           */
  #define PPIB_OVERFLOW_SEND_SEND31_NoOverflow (0x0UL) /*!< Task overflow is not happened.                                     */


