NordicSemiconductor/nrfx/mdk/nrf54lv10a_enga_types.h
/* CNACCQ @Bits 16..31 : (unspecified) */
  #define RADIO_CSTONES_CNACC_CNACCQ_Pos (16UL)      /*!< Position of CNACCQ field.                                            */
  #define RADIO_CSTONES_CNACC_CNACCQ_Msk (0xFFFFUL << RADIO_CSTONES_CNACC_CNACCQ_Pos) /*!< Bit mask of CNACCQ field.           */


/* RADIO_CSTONES_FFOEST: FFO estimate */
  #define RADIO_CSTONES_FFOEST_ResetValue (0x00000000UL) /*!< Reset value of FFOEST register.                                  */

/* FFOEST @Bits 0..11 : Units 62.5 ppb. Max range +/-100 ppm plus margin. */
  #define RADIO_CSTONES_FFOEST_FFOEST_Pos (0UL)      /*!< Position of FFOEST field.                                            */
  #define RADIO_CSTONES_FFOEST_FFOEST_Msk (0xFFFUL << RADIO_CSTONES_FFOEST_FFOEST_Pos) /*!< Bit mask of FFOEST field.          */


/* RADIO_CSTONES_DOWNSAMPLE: Turn on/off down sample of input IQ-signals */
  #define RADIO_CSTONES_DOWNSAMPLE_ResetValue (0x00000000UL) /*!< Reset value of DOWNSAMPLE register.                          */

/* ENABLEFILTER @Bit 0 : Turn on/off down sample of input IQ-signals */
  #define RADIO_CSTONES_DOWNSAMPLE_ENABLEFILTER_Pos (0UL) /*!< Position of ENABLEFILTER field.                                 */
  #define RADIO_CSTONES_DOWNSAMPLE_ENABLEFILTER_Msk (0x1UL << RADIO_CSTONES_DOWNSAMPLE_ENABLEFILTER_Pos) /*!< Bit mask of
                                                                            ENABLEFILTER field.*/
  #define RADIO_CSTONES_DOWNSAMPLE_ENABLEFILTER_Min (0x0UL) /*!< Min enumerator value of ENABLEFILTER field.                   */
  #define RADIO_CSTONES_DOWNSAMPLE_ENABLEFILTER_Max (0x1UL) /*!< Max enumerator value of ENABLEFILTER field.                   */
  #define RADIO_CSTONES_DOWNSAMPLE_ENABLEFILTER_OFF (0x0UL) /*!< Disable filter                                                */
  #define RADIO_CSTONES_DOWNSAMPLE_ENABLEFILTER_ON (0x1UL) /*!< Enable filter                                                  */

/* RATE @Bit 1 : Indicating if BLE1M or BLE2M is used */
  #define RADIO_CSTONES_DOWNSAMPLE_RATE_Pos (1UL)    /*!< Position of RATE field.                                              */
  #define RADIO_CSTONES_DOWNSAMPLE_RATE_Msk (0x1UL << RADIO_CSTONES_DOWNSAMPLE_RATE_Pos) /*!< Bit mask of RATE field.          */
  #define RADIO_CSTONES_DOWNSAMPLE_RATE_Min (0x0UL)  /*!< Min enumerator value of RATE field.                                  */
  #define RADIO_CSTONES_DOWNSAMPLE_RATE_Max (0x1UL)  /*!< Max enumerator value of RATE field.                                  */
  #define RADIO_CSTONES_DOWNSAMPLE_RATE_BLE1M (0x0UL) /*!< Radio mode BLE1M is used                                            */
  #define RADIO_CSTONES_DOWNSAMPLE_RATE_BLE2m (0x1UL) /*!< Radio mode BLE2M is used                                            */


/* RADIO_CSTONES_FINETUNENEXT: Number of full ADPLL finetune steps */
  #define RADIO_CSTONES_FINETUNENEXT_ResetValue (0x00000000UL) /*!< Reset value of FINETUNENEXT register.                      */

/* FINETUNENEXT @Bits 0..12 : Units of 488.28125 Hz */
  #define RADIO_CSTONES_FINETUNENEXT_FINETUNENEXT_Pos (0UL) /*!< Position of FINETUNENEXT field.                               */
  #define RADIO_CSTONES_FINETUNENEXT_FINETUNENEXT_Msk (0x1FFFUL << RADIO_CSTONES_FINETUNENEXT_FINETUNENEXT_Pos) /*!< Bit mask of
                                                                            FINETUNENEXT field.*/


/* RADIO_CSTONES_CFOPHASE: Cordic output of CnAcc */
  #define RADIO_CSTONES_CFOPHASE_ResetValue (0x00000000UL) /*!< Reset value of CFOPHASE register.                              */

/* CFOPHASE @Bits 0..15 : (unspecified) */
  #define RADIO_CSTONES_CFOPHASE_CFOPHASE_Pos (0UL)  /*!< Position of CFOPHASE field.                                          */
  #define RADIO_CSTONES_CFOPHASE_CFOPHASE_Msk (0xFFFFUL << RADIO_CSTONES_CFOPHASE_CFOPHASE_Pos) /*!< Bit mask of CFOPHASE
                                                                            field.*/


/* RADIO_CSTONES_FREQOFFSET: Frequency offset estimate */
  #define RADIO_CSTONES_FREQOFFSET_ResetValue (0x00000000UL) /*!< Reset value of FREQOFFSET register.                          */

/* FREQOFFSET @Bits 0..13 : (unspecified) */
  #define RADIO_CSTONES_FREQOFFSET_FREQOFFSET_Pos (0UL) /*!< Position of FREQOFFSET field.                                     */
  #define RADIO_CSTONES_FREQOFFSET_FREQOFFSET_Msk (0x3FFFUL << RADIO_CSTONES_FREQOFFSET_FREQOFFSET_Pos) /*!< Bit mask of
                                                                            FREQOFFSET field.*/


/* RADIO_CSTONES_PCT11: Mean magnitude and mean phase converted to IQ. IQ values limited to [-1024,1023]. */
  #define RADIO_CSTONES_PCT11_ResetValue (0x00000000UL) /*!< Reset value of PCT11 register.                                    */

/* PCT11I @Bits 0..10 : Inphase */
  #define RADIO_CSTONES_PCT11_PCT11I_Pos (0UL)       /*!< Position of PCT11I field.                                            */
  #define RADIO_CSTONES_PCT11_PCT11I_Msk (0x7FFUL << RADIO_CSTONES_PCT11_PCT11I_Pos) /*!< Bit mask of PCT11I field.            */

/* PCT11Q @Bits 11..21 : Quadrature */
  #define RADIO_CSTONES_PCT11_PCT11Q_Pos (11UL)      /*!< Position of PCT11Q field.                                            */
  #define RADIO_CSTONES_PCT11_PCT11Q_Msk (0x7FFUL << RADIO_CSTONES_PCT11_PCT11Q_Pos) /*!< Bit mask of PCT11Q field.            */


/* RADIO_CSTONES_LFAENEXT: Quantization error between ADPLL frequency and the desired value of FFO * RF Frequency. Values
                            limited to [-64,63] with units 7.6294 Hz. */

  #define RADIO_CSTONES_LFAENEXT_ResetValue (0x00000000UL) /*!< Reset value of LFAENEXT register.                              */

/* LFAENEXT @Bits 0..6 : Inphase */
  #define RADIO_CSTONES_LFAENEXT_LFAENEXT_Pos (0UL)  /*!< Position of LFAENEXT field.                                          */
  #define RADIO_CSTONES_LFAENEXT_LFAENEXT_Msk (0x7FUL << RADIO_CSTONES_LFAENEXT_LFAENEXT_Pos) /*!< Bit mask of LFAENEXT field. */



