NordicSemiconductor/nrfx/mdk/nrf54lv10a_enga_types.h
/* VAL @Bit 0 : Enable DC/DC buck converter */
  #define REGULATORS_VREGMAIN_DCDCEN_VAL_Pos (0UL)   /*!< Position of VAL field.                                               */
  #define REGULATORS_VREGMAIN_DCDCEN_VAL_Msk (0x1UL << REGULATORS_VREGMAIN_DCDCEN_VAL_Pos) /*!< Bit mask of VAL field.         */
  #define REGULATORS_VREGMAIN_DCDCEN_VAL_Min (0x0UL) /*!< Min enumerator value of VAL field.                                   */
  #define REGULATORS_VREGMAIN_DCDCEN_VAL_Max (0x1UL) /*!< Max enumerator value of VAL field.                                   */
  #define REGULATORS_VREGMAIN_DCDCEN_VAL_Disabled (0x0UL) /*!< Disable DC/DC converter and use LDO                             */
  #define REGULATORS_VREGMAIN_DCDCEN_VAL_Enabled (0x1UL) /*!< Enable DC/DC converter                                           */


/* REGULATORS_VREGMAIN_INDUCTORDET: VREGMAIN inductor detection */
  #define REGULATORS_VREGMAIN_INDUCTORDET_ResetValue (0x00000000UL) /*!< Reset value of INDUCTORDET register.                  */

/* DETECTED @Bit 0 : (unspecified) */
  #define REGULATORS_VREGMAIN_INDUCTORDET_DETECTED_Pos (0UL) /*!< Position of DETECTED field.                                  */
  #define REGULATORS_VREGMAIN_INDUCTORDET_DETECTED_Msk (0x1UL << REGULATORS_VREGMAIN_INDUCTORDET_DETECTED_Pos) /*!< Bit mask of
                                                                            DETECTED field.*/
  #define REGULATORS_VREGMAIN_INDUCTORDET_DETECTED_Min (0x0UL) /*!< Min enumerator value of DETECTED field.                    */
  #define REGULATORS_VREGMAIN_INDUCTORDET_DETECTED_Max (0x1UL) /*!< Max enumerator value of DETECTED field.                    */
  #define REGULATORS_VREGMAIN_INDUCTORDET_DETECTED_InductorNotDetected (0x0UL) /*!< VREGMAIN inductor not detected             */
  #define REGULATORS_VREGMAIN_INDUCTORDET_DETECTED_InductorDetected (0x1UL) /*!< VREGMAIN inductor detected                    */


/* ==================================================== Struct REGULATORS ==================================================== */
/**
  * @brief Voltage regulators
  */
  typedef struct {                                   /*!< REGULATORS Structure                                                 */
    __IM uint32_t RESERVED[256];
    __IOM NRF_REGULATORS_HIBERNATOR_Type HIBERNATOR; /*!< (@ 0x00000400) Hibernator interface                                  */
    __IM uint32_t RESERVED1[61];
    __OM uint32_t SYSTEMOFF;                         /*!< (@ 0x00000500) System OFF register                                   */
    __IM uint32_t RESERVED2[11];
    __IOM uint32_t POFCON;                           /*!< (@ 0x00000530) Power-fail comparator configuration                   */
    __IM uint32_t POFSTAT;                           /*!< (@ 0x00000534) Power-fail comparator status register                 */
    __IM uint32_t RESERVED3[50];
    __IOM NRF_REGULATORS_VREGMAIN_Type VREGMAIN;     /*!< (@ 0x00000600) Register interface for main voltage regulator.        */
  } NRF_REGULATORS_Type;                             /*!< Size = 1544 (0x608)                                                  */

/* REGULATORS_SYSTEMOFF: System OFF register */
  #define REGULATORS_SYSTEMOFF_ResetValue (0x00000000UL) /*!< Reset value of SYSTEMOFF register.                               */

/* SYSTEMOFF @Bit 0 : Enable System OFF mode */
  #define REGULATORS_SYSTEMOFF_SYSTEMOFF_Pos (0UL)   /*!< Position of SYSTEMOFF field.                                         */
  #define REGULATORS_SYSTEMOFF_SYSTEMOFF_Msk (0x1UL << REGULATORS_SYSTEMOFF_SYSTEMOFF_Pos) /*!< Bit mask of SYSTEMOFF field.   */
  #define REGULATORS_SYSTEMOFF_SYSTEMOFF_Min (0x1UL) /*!< Min enumerator value of SYSTEMOFF field.                             */
  #define REGULATORS_SYSTEMOFF_SYSTEMOFF_Max (0x1UL) /*!< Max enumerator value of SYSTEMOFF field.                             */
  #define REGULATORS_SYSTEMOFF_SYSTEMOFF_Enter (0x1UL) /*!< Enable System OFF mode                                             */


/* REGULATORS_POFCON: Power-fail comparator configuration */
  #define REGULATORS_POFCON_ResetValue (0x00000000UL) /*!< Reset value of POFCON register.                                     */

/* POF @Bit 0 : Enable or disable power-fail comparator */
  #define REGULATORS_POFCON_POF_Pos (0UL)            /*!< Position of POF field.                                               */
  #define REGULATORS_POFCON_POF_Msk (0x1UL << REGULATORS_POFCON_POF_Pos) /*!< Bit mask of POF field.                           */
  #define REGULATORS_POFCON_POF_Min (0x0UL)          /*!< Min enumerator value of POF field.                                   */
  #define REGULATORS_POFCON_POF_Max (0x1UL)          /*!< Max enumerator value of POF field.                                   */
  #define REGULATORS_POFCON_POF_Disabled (0x0UL)     /*!< Disable                                                              */
  #define REGULATORS_POFCON_POF_Enabled (0x1UL)      /*!< Enable                                                               */

/* THRESHOLD @Bits 1..4 : Power-fail comparator threshold setting */
  #define REGULATORS_POFCON_THRESHOLD_Pos (1UL)      /*!< Position of THRESHOLD field.                                         */
  #define REGULATORS_POFCON_THRESHOLD_Msk (0xFUL << REGULATORS_POFCON_THRESHOLD_Pos) /*!< Bit mask of THRESHOLD field.         */
  #define REGULATORS_POFCON_THRESHOLD_Min (0x0UL)    /*!< Min enumerator value of THRESHOLD field.                             */
  #define REGULATORS_POFCON_THRESHOLD_Max (0xBUL)    /*!< Max enumerator value of THRESHOLD field.                             */
  #define REGULATORS_POFCON_THRESHOLD_V17 (0x0UL)    /*!< Set threshold to 1.7 V                                               */
  #define REGULATORS_POFCON_THRESHOLD_V18 (0x1UL)    /*!< Set threshold to 1.8 V                                               */
  #define REGULATORS_POFCON_THRESHOLD_V19 (0x2UL)    /*!< Set threshold to 1.9 V                                               */
  #define REGULATORS_POFCON_THRESHOLD_V20 (0x3UL)    /*!< Set threshold to 2.0 V                                               */
  #define REGULATORS_POFCON_THRESHOLD_V21 (0x4UL)    /*!< Set threshold to 2.1 V                                               */
  #define REGULATORS_POFCON_THRESHOLD_V22 (0x5UL)    /*!< Set threshold to 2.2 V                                               */
  #define REGULATORS_POFCON_THRESHOLD_V23 (0x6UL)    /*!< Set threshold to 2.3 V                                               */
  #define REGULATORS_POFCON_THRESHOLD_V24 (0x7UL)    /*!< Set threshold to 2.4 V                                               */
  #define REGULATORS_POFCON_THRESHOLD_V25 (0x8UL)    /*!< Set threshold to 2.5 V                                               */
  #define REGULATORS_POFCON_THRESHOLD_V26 (0x9UL)    /*!< Set threshold to 2.6 V                                               */
  #define REGULATORS_POFCON_THRESHOLD_V27 (0xAUL)    /*!< Set threshold to 2.7 V                                               */
  #define REGULATORS_POFCON_THRESHOLD_V28 (0xBUL)    /*!< Set threshold to 2.8 V                                               */

/* EVENTDISABLE @Bit 7 : Disable the POFWARN power-fail warning event */
  #define REGULATORS_POFCON_EVENTDISABLE_Pos (7UL)   /*!< Position of EVENTDISABLE field.                                      */
  #define REGULATORS_POFCON_EVENTDISABLE_Msk (0x1UL << REGULATORS_POFCON_EVENTDISABLE_Pos) /*!< Bit mask of EVENTDISABLE field.*/
  #define REGULATORS_POFCON_EVENTDISABLE_Min (0x0UL) /*!< Min enumerator value of EVENTDISABLE field.                          */
  #define REGULATORS_POFCON_EVENTDISABLE_Max (0x1UL) /*!< Max enumerator value of EVENTDISABLE field.                          */
  #define REGULATORS_POFCON_EVENTDISABLE_Enabled (0x0UL) /*!< POFWARN event is generated                                       */
  #define REGULATORS_POFCON_EVENTDISABLE_Disabled (0x1UL) /*!< POFWARN event is not generated                                  */

