NordicSemiconductor/nrfx/mdk/nrf54lv10a_enga_types.h
/* PSEL @Bit 16 : Power-fail comparator input selector */
  #define REGULATORS_POFCON_PSEL_Pos (16UL)          /*!< Position of PSEL field.                                              */
  #define REGULATORS_POFCON_PSEL_Msk (0x1UL << REGULATORS_POFCON_PSEL_Pos) /*!< Bit mask of PSEL field.                        */
  #define REGULATORS_POFCON_PSEL_Min (0x0UL)         /*!< Min enumerator value of PSEL field.                                  */
  #define REGULATORS_POFCON_PSEL_Max (0x1UL)         /*!< Max enumerator value of PSEL field.                                  */
  #define REGULATORS_POFCON_PSEL_vddAo3v0Connected (0x0UL) /*!< POF input connected to VDD_AO_3V0                              */
  #define REGULATORS_POFCON_PSEL_vinLvBatConnected (0x1UL) /*!< POF input connected to VIN_LVBATT                              */


/* REGULATORS_POFSTAT: Power-fail comparator status register */
  #define REGULATORS_POFSTAT_ResetValue (0x00000000UL) /*!< Reset value of POFSTAT register.                                   */

/* COMPARATOR @Bit 0 : Power-fail comparator status */
  #define REGULATORS_POFSTAT_COMPARATOR_Pos (0UL)    /*!< Position of COMPARATOR field.                                        */
  #define REGULATORS_POFSTAT_COMPARATOR_Msk (0x1UL << REGULATORS_POFSTAT_COMPARATOR_Pos) /*!< Bit mask of COMPARATOR field.    */
  #define REGULATORS_POFSTAT_COMPARATOR_Min (0x0UL)  /*!< Min enumerator value of COMPARATOR field.                            */
  #define REGULATORS_POFSTAT_COMPARATOR_Max (0x1UL)  /*!< Max enumerator value of COMPARATOR field.                            */
  #define REGULATORS_POFSTAT_COMPARATOR_Above (0x0UL) /*!< Voltage detected above VPOF threshold                               */
  #define REGULATORS_POFSTAT_COMPARATOR_Below (0x1UL) /*!< Voltage detected below VPOF threshold                               */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RESET                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct RESET ======================================================= */
/**
  * @brief Reset control
  */
  typedef struct {                                   /*!< RESET Structure                                                      */
    __IM uint32_t RESERVED[384];
    __IOM uint32_t RESETREAS;                        /*!< (@ 0x00000600) Reset reason                                          */
  } NRF_RESET_Type;                                  /*!< Size = 1540 (0x604)                                                  */

/* RESET_RESETREAS: Reset reason */
  #define RESET_RESETREAS_ResetValue (0x00000000UL)  /*!< Reset value of RESETREAS register.                                   */

/* RESETPIN @Bit 0 : Reset from pin reset detected */
  #define RESET_RESETREAS_RESETPIN_Pos (0UL)         /*!< Position of RESETPIN field.                                          */
  #define RESET_RESETREAS_RESETPIN_Msk (0x1UL << RESET_RESETREAS_RESETPIN_Pos) /*!< Bit mask of RESETPIN field.                */
  #define RESET_RESETREAS_RESETPIN_Min (0x0UL)       /*!< Min enumerator value of RESETPIN field.                              */
  #define RESET_RESETREAS_RESETPIN_Max (0x1UL)       /*!< Max enumerator value of RESETPIN field.                              */
  #define RESET_RESETREAS_RESETPIN_NotDetected (0x0UL) /*!< Not detected                                                       */
  #define RESET_RESETREAS_RESETPIN_Detected (0x1UL)  /*!< Detected                                                             */

/* DOG0 @Bit 1 : Reset from watchdog timer 0 detected */
  #define RESET_RESETREAS_DOG0_Pos (1UL)             /*!< Position of DOG0 field.                                              */
  #define RESET_RESETREAS_DOG0_Msk (0x1UL << RESET_RESETREAS_DOG0_Pos) /*!< Bit mask of DOG0 field.                            */
  #define RESET_RESETREAS_DOG0_Min (0x0UL)           /*!< Min enumerator value of DOG0 field.                                  */
  #define RESET_RESETREAS_DOG0_Max (0x1UL)           /*!< Max enumerator value of DOG0 field.                                  */
  #define RESET_RESETREAS_DOG0_NotDetected (0x0UL)   /*!< Not detected                                                         */
  #define RESET_RESETREAS_DOG0_Detected (0x1UL)      /*!< Detected                                                             */

/* DOG1 @Bit 2 : Reset from watchdog timer 1 detected */
  #define RESET_RESETREAS_DOG1_Pos (2UL)             /*!< Position of DOG1 field.                                              */
  #define RESET_RESETREAS_DOG1_Msk (0x1UL << RESET_RESETREAS_DOG1_Pos) /*!< Bit mask of DOG1 field.                            */
  #define RESET_RESETREAS_DOG1_Min (0x0UL)           /*!< Min enumerator value of DOG1 field.                                  */
  #define RESET_RESETREAS_DOG1_Max (0x1UL)           /*!< Max enumerator value of DOG1 field.                                  */
  #define RESET_RESETREAS_DOG1_NotDetected (0x0UL)   /*!< Not detected                                                         */
  #define RESET_RESETREAS_DOG1_Detected (0x1UL)      /*!< Detected                                                             */

/* CTRLAPSOFT @Bit 3 : Soft reset from CTRL-AP detected */
  #define RESET_RESETREAS_CTRLAPSOFT_Pos (3UL)       /*!< Position of CTRLAPSOFT field.                                        */
  #define RESET_RESETREAS_CTRLAPSOFT_Msk (0x1UL << RESET_RESETREAS_CTRLAPSOFT_Pos) /*!< Bit mask of CTRLAPSOFT field.          */
  #define RESET_RESETREAS_CTRLAPSOFT_Min (0x0UL)     /*!< Min enumerator value of CTRLAPSOFT field.                            */
  #define RESET_RESETREAS_CTRLAPSOFT_Max (0x1UL)     /*!< Max enumerator value of CTRLAPSOFT field.                            */
  #define RESET_RESETREAS_CTRLAPSOFT_NotDetected (0x0UL) /*!< Not detected                                                     */
  #define RESET_RESETREAS_CTRLAPSOFT_Detected (0x1UL) /*!< Detected                                                            */

