NordicSemiconductor/nrfx/mdk/nrf54lv10a_enga_types.h
/* READY @Bit 1 : Write '1' to enable interrupt for event READY */
  #define RRAMC_INTENSET_READY_Pos (1UL)             /*!< Position of READY field.                                             */
  #define RRAMC_INTENSET_READY_Msk (0x1UL << RRAMC_INTENSET_READY_Pos) /*!< Bit mask of READY field.                           */
  #define RRAMC_INTENSET_READY_Min (0x0UL)           /*!< Min enumerator value of READY field.                                 */
  #define RRAMC_INTENSET_READY_Max (0x1UL)           /*!< Max enumerator value of READY field.                                 */
  #define RRAMC_INTENSET_READY_Set (0x1UL)           /*!< Enable                                                               */
  #define RRAMC_INTENSET_READY_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define RRAMC_INTENSET_READY_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* READYNEXT @Bit 2 : Write '1' to enable interrupt for event READYNEXT */
  #define RRAMC_INTENSET_READYNEXT_Pos (2UL)         /*!< Position of READYNEXT field.                                         */
  #define RRAMC_INTENSET_READYNEXT_Msk (0x1UL << RRAMC_INTENSET_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.               */
  #define RRAMC_INTENSET_READYNEXT_Min (0x0UL)       /*!< Min enumerator value of READYNEXT field.                             */
  #define RRAMC_INTENSET_READYNEXT_Max (0x1UL)       /*!< Max enumerator value of READYNEXT field.                             */
  #define RRAMC_INTENSET_READYNEXT_Set (0x1UL)       /*!< Enable                                                               */
  #define RRAMC_INTENSET_READYNEXT_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RRAMC_INTENSET_READYNEXT_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* ACCESSERROR @Bit 3 : Write '1' to enable interrupt for event ACCESSERROR */
  #define RRAMC_INTENSET_ACCESSERROR_Pos (3UL)       /*!< Position of ACCESSERROR field.                                       */
  #define RRAMC_INTENSET_ACCESSERROR_Msk (0x1UL << RRAMC_INTENSET_ACCESSERROR_Pos) /*!< Bit mask of ACCESSERROR field.         */
  #define RRAMC_INTENSET_ACCESSERROR_Min (0x0UL)     /*!< Min enumerator value of ACCESSERROR field.                           */
  #define RRAMC_INTENSET_ACCESSERROR_Max (0x1UL)     /*!< Max enumerator value of ACCESSERROR field.                           */
  #define RRAMC_INTENSET_ACCESSERROR_Set (0x1UL)     /*!< Enable                                                               */
  #define RRAMC_INTENSET_ACCESSERROR_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RRAMC_INTENSET_ACCESSERROR_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* RRAMC_INTENCLR: Disable interrupt */
  #define RRAMC_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* WOKENUP @Bit 0 : Write '1' to disable interrupt for event WOKENUP */
  #define RRAMC_INTENCLR_WOKENUP_Pos (0UL)           /*!< Position of WOKENUP field.                                           */
  #define RRAMC_INTENCLR_WOKENUP_Msk (0x1UL << RRAMC_INTENCLR_WOKENUP_Pos) /*!< Bit mask of WOKENUP field.                     */
  #define RRAMC_INTENCLR_WOKENUP_Min (0x0UL)         /*!< Min enumerator value of WOKENUP field.                               */
  #define RRAMC_INTENCLR_WOKENUP_Max (0x1UL)         /*!< Max enumerator value of WOKENUP field.                               */
  #define RRAMC_INTENCLR_WOKENUP_Clear (0x1UL)       /*!< Disable                                                              */
  #define RRAMC_INTENCLR_WOKENUP_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define RRAMC_INTENCLR_WOKENUP_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* READY @Bit 1 : Write '1' to disable interrupt for event READY */
  #define RRAMC_INTENCLR_READY_Pos (1UL)             /*!< Position of READY field.                                             */
  #define RRAMC_INTENCLR_READY_Msk (0x1UL << RRAMC_INTENCLR_READY_Pos) /*!< Bit mask of READY field.                           */
  #define RRAMC_INTENCLR_READY_Min (0x0UL)           /*!< Min enumerator value of READY field.                                 */
  #define RRAMC_INTENCLR_READY_Max (0x1UL)           /*!< Max enumerator value of READY field.                                 */
  #define RRAMC_INTENCLR_READY_Clear (0x1UL)         /*!< Disable                                                              */
  #define RRAMC_INTENCLR_READY_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define RRAMC_INTENCLR_READY_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* READYNEXT @Bit 2 : Write '1' to disable interrupt for event READYNEXT */
  #define RRAMC_INTENCLR_READYNEXT_Pos (2UL)         /*!< Position of READYNEXT field.                                         */
  #define RRAMC_INTENCLR_READYNEXT_Msk (0x1UL << RRAMC_INTENCLR_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.               */
  #define RRAMC_INTENCLR_READYNEXT_Min (0x0UL)       /*!< Min enumerator value of READYNEXT field.                             */
  #define RRAMC_INTENCLR_READYNEXT_Max (0x1UL)       /*!< Max enumerator value of READYNEXT field.                             */
  #define RRAMC_INTENCLR_READYNEXT_Clear (0x1UL)     /*!< Disable                                                              */
  #define RRAMC_INTENCLR_READYNEXT_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RRAMC_INTENCLR_READYNEXT_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

