NordicSemiconductor/nrfx/mdk/nrf54lv10a_enga_types.h
/* UICR_APPROTECT_PROTECT1: Access port protection */
  #define UICR_APPROTECT_PROTECT1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PROTECT1 register.                             */

/* PALL @Bits 0..31 : (unspecified) */
  #define UICR_APPROTECT_PROTECT1_PALL_Pos (0UL)     /*!< Position of PALL field.                                              */
  #define UICR_APPROTECT_PROTECT1_PALL_Msk (0xFFFFFFFFUL << UICR_APPROTECT_PROTECT1_PALL_Pos) /*!< Bit mask of PALL field.     */
  #define UICR_APPROTECT_PROTECT1_PALL_Min (0xFFFFFFFFUL) /*!< Min enumerator value of PALL field.                             */
  #define UICR_APPROTECT_PROTECT1_PALL_Max (0xFFFFFFFFUL) /*!< Max enumerator value of PALL field.                             */
  #define UICR_APPROTECT_PROTECT1_PALL_Unprotected (0xFFFFFFFFUL) /*!< Leaves TAMPC PROTECT.DOMAIN DBGEN and NIDEN signal
                                                                       protectors unlocked and under CPU control.*/



/* =============================================== Struct UICR_SECUREAPPROTECT =============================================== */
/**
  * @brief SECUREAPPROTECT [UICR_SECUREAPPROTECT] Access Port Protection Registers
  */
typedef struct {
  __IOM uint32_t  PROTECT0;                          /*!< (@ 0x00000000) Access port protection                                */
  __IM  uint32_t  RESERVED[6];
  __IOM uint32_t  PROTECT1;                          /*!< (@ 0x0000001C) Access port protection register                       */
} NRF_UICR_SECUREAPPROTECT_Type;                     /*!< Size = 32 (0x020)                                                    */
  #define UICR_SECUREAPPROTECT_MaxCount (1UL)        /*!< Size of SECUREAPPROTECT[1] array.                                    */
  #define UICR_SECUREAPPROTECT_MaxIndex (0UL)        /*!< Max index of SECUREAPPROTECT[1] array.                               */
  #define UICR_SECUREAPPROTECT_MinIndex (0UL)        /*!< Min index of SECUREAPPROTECT[1] array.                               */

/* UICR_SECUREAPPROTECT_PROTECT0: Access port protection */
  #define UICR_SECUREAPPROTECT_PROTECT0_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PROTECT0 register.                       */

/* PALL @Bits 0..31 : (unspecified) */
  #define UICR_SECUREAPPROTECT_PROTECT0_PALL_Pos (0UL) /*!< Position of PALL field.                                            */
  #define UICR_SECUREAPPROTECT_PROTECT0_PALL_Msk (0xFFFFFFFFUL << UICR_SECUREAPPROTECT_PROTECT0_PALL_Pos) /*!< Bit mask of PALL
                                                                            field.*/
  #define UICR_SECUREAPPROTECT_PROTECT0_PALL_Min (0xFFFFFFFFUL) /*!< Min enumerator value of PALL field.                       */
  #define UICR_SECUREAPPROTECT_PROTECT0_PALL_Max (0xFFFFFFFFUL) /*!< Max enumerator value of PALL field.                       */
  #define UICR_SECUREAPPROTECT_PROTECT0_PALL_Unprotected (0xFFFFFFFFUL) /*!< Leaves TAMPC PROTECT.DOMAIN SPIDEN and SPNIDEN
                                                                            signal protectors unlocked and under CPU control.*/


/* UICR_SECUREAPPROTECT_PROTECT1: Access port protection register */
  #define UICR_SECUREAPPROTECT_PROTECT1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PROTECT1 register.                       */

/* PALL @Bits 0..31 : (unspecified) */
  #define UICR_SECUREAPPROTECT_PROTECT1_PALL_Pos (0UL) /*!< Position of PALL field.                                            */
  #define UICR_SECUREAPPROTECT_PROTECT1_PALL_Msk (0xFFFFFFFFUL << UICR_SECUREAPPROTECT_PROTECT1_PALL_Pos) /*!< Bit mask of PALL
                                                                            field.*/
  #define UICR_SECUREAPPROTECT_PROTECT1_PALL_Min (0xFFFFFFFFUL) /*!< Min enumerator value of PALL field.                       */
  #define UICR_SECUREAPPROTECT_PROTECT1_PALL_Max (0xFFFFFFFFUL) /*!< Max enumerator value of PALL field.                       */
  #define UICR_SECUREAPPROTECT_PROTECT1_PALL_Unprotected (0xFFFFFFFFUL) /*!< Leaves TAMPC PROTECT.DOMAIN SPIDEN and SPNIDEN
                                                                            signal protectors unlocked and under CPU control.*/



/* ================================================ Struct UICR_AUXAPPROTECT ================================================= */
/**
  * @brief AUXAPPROTECT [UICR_AUXAPPROTECT] Access Port Protection Registers
  */
typedef struct {
  __IOM uint32_t  PROTECT0;                          /*!< (@ 0x00000000) Access port protection                                */
  __IM  uint32_t  RESERVED[6];
  __IOM uint32_t  PROTECT1;                          /*!< (@ 0x0000001C) Access port protection register                       */
} NRF_UICR_AUXAPPROTECT_Type;                        /*!< Size = 32 (0x020)                                                    */
  #define UICR_AUXAPPROTECT_MaxCount (1UL)           /*!< Size of AUXAPPROTECT[1] array.                                       */
  #define UICR_AUXAPPROTECT_MaxIndex (0UL)           /*!< Max index of AUXAPPROTECT[1] array.                                  */
  #define UICR_AUXAPPROTECT_MinIndex (0UL)           /*!< Min index of AUXAPPROTECT[1] array.                                  */

/* UICR_AUXAPPROTECT_PROTECT0: Access port protection */
  #define UICR_AUXAPPROTECT_PROTECT0_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PROTECT0 register.                          */

/* PALL @Bits 0..31 : (unspecified) */
  #define UICR_AUXAPPROTECT_PROTECT0_PALL_Pos (0UL)  /*!< Position of PALL field.                                              */
  #define UICR_AUXAPPROTECT_PROTECT0_PALL_Msk (0xFFFFFFFFUL << UICR_AUXAPPROTECT_PROTECT0_PALL_Pos) /*!< Bit mask of PALL
                                                                            field.*/
  #define UICR_AUXAPPROTECT_PROTECT0_PALL_Min (0xFFFFFFFFUL) /*!< Min enumerator value of PALL field.                          */
  #define UICR_AUXAPPROTECT_PROTECT0_PALL_Max (0xFFFFFFFFUL) /*!< Max enumerator value of PALL field.                          */
  #define UICR_AUXAPPROTECT_PROTECT0_PALL_Unprotected (0xFFFFFFFFUL) /*!< Leaves TAMPC PROTECT.AP DBGEN signal protector
                                                                          unlocked and under CPU control.*/


/* UICR_AUXAPPROTECT_PROTECT1: Access port protection register */
  #define UICR_AUXAPPROTECT_PROTECT1_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PROTECT1 register.                          */

/* PALL @Bits 0..31 : (unspecified) */
  #define UICR_AUXAPPROTECT_PROTECT1_PALL_Pos (0UL)  /*!< Position of PALL field.                                              */
  #define UICR_AUXAPPROTECT_PROTECT1_PALL_Msk (0xFFFFFFFFUL << UICR_AUXAPPROTECT_PROTECT1_PALL_Pos) /*!< Bit mask of PALL
                                                                            field.*/
  #define UICR_AUXAPPROTECT_PROTECT1_PALL_Min (0xFFFFFFFFUL) /*!< Min enumerator value of PALL field.                          */
  #define UICR_AUXAPPROTECT_PROTECT1_PALL_Max (0xFFFFFFFFUL) /*!< Max enumerator value of PALL field.                          */
  #define UICR_AUXAPPROTECT_PROTECT1_PALL_Unprotected (0xFFFFFFFFUL) /*!< Leaves TAMPC PROTECT.AP DBGEN signal protector
                                                                          unlocked and under CPU control.*/



