NordicSemiconductor/nrfx/mdk/nrf54lv10a_enga_types.h
/* VPR_EVENTS_TRIGGERED: VPR event [n] register */
  #define VPR_EVENTS_TRIGGERED_MaxCount (7UL)        /*!< Max size of EVENTS_TRIGGERED[23] array.                              */
  #define VPR_EVENTS_TRIGGERED_MaxIndex (22UL)       /*!< Max index of EVENTS_TRIGGERED[23] array.                             */
  #define VPR_EVENTS_TRIGGERED_MinIndex (16UL)       /*!< Min index of EVENTS_TRIGGERED[23] array.                             */
  #define VPR_EVENTS_TRIGGERED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TRIGGERED[23] register.                    */

/* EVENTS_TRIGGERED @Bit 0 : VPR event [n] register */
  #define VPR_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos (0UL) /*!< Position of EVENTS_TRIGGERED field.                             */
  #define VPR_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Msk (0x1UL << VPR_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Pos) /*!< Bit mask of
                                                                            EVENTS_TRIGGERED field.*/
  #define VPR_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Min (0x0UL) /*!< Min enumerator value of EVENTS_TRIGGERED field.               */
  #define VPR_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Max (0x1UL) /*!< Max enumerator value of EVENTS_TRIGGERED field.               */
  #define VPR_EVENTS_TRIGGERED_EVENTS_TRIGGERED_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define VPR_EVENTS_TRIGGERED_EVENTS_TRIGGERED_Generated (0x1UL) /*!< Event generated                                         */


/* VPR_PUBLISH_TRIGGERED: Publish configuration for event EVENTS_TRIGGERED[n] */
  #define VPR_PUBLISH_TRIGGERED_MaxCount (4UL)       /*!< Max size of PUBLISH_TRIGGERED[4] array.                              */
  #define VPR_PUBLISH_TRIGGERED_MaxIndex (3UL)       /*!< Max index of PUBLISH_TRIGGERED[4] array.                             */
  #define VPR_PUBLISH_TRIGGERED_MinIndex (0UL)       /*!< Min index of PUBLISH_TRIGGERED[4] array.                             */
  #define VPR_PUBLISH_TRIGGERED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TRIGGERED[4] register.                   */

/* EN @Bit 31 : Publication enable bit */
  #define VPR_PUBLISH_TRIGGERED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define VPR_PUBLISH_TRIGGERED_EN_Msk (0x1UL << VPR_PUBLISH_TRIGGERED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define VPR_PUBLISH_TRIGGERED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define VPR_PUBLISH_TRIGGERED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define VPR_PUBLISH_TRIGGERED_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define VPR_PUBLISH_TRIGGERED_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* VPR_INTEN: Enable or disable interrupt */
  #define VPR_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* TRIGGERED16 @Bit 16 : Enable or disable interrupt for event TRIGGERED[16] */
  #define VPR_INTEN_TRIGGERED16_Pos (16UL)           /*!< Position of TRIGGERED16 field.                                       */
  #define VPR_INTEN_TRIGGERED16_Msk (0x1UL << VPR_INTEN_TRIGGERED16_Pos) /*!< Bit mask of TRIGGERED16 field.                   */
  #define VPR_INTEN_TRIGGERED16_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED16 field.                           */
  #define VPR_INTEN_TRIGGERED16_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED16 field.                           */
  #define VPR_INTEN_TRIGGERED16_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED16_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED17 @Bit 17 : Enable or disable interrupt for event TRIGGERED[17] */
  #define VPR_INTEN_TRIGGERED17_Pos (17UL)           /*!< Position of TRIGGERED17 field.                                       */
  #define VPR_INTEN_TRIGGERED17_Msk (0x1UL << VPR_INTEN_TRIGGERED17_Pos) /*!< Bit mask of TRIGGERED17 field.                   */
  #define VPR_INTEN_TRIGGERED17_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED17 field.                           */
  #define VPR_INTEN_TRIGGERED17_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED17 field.                           */
  #define VPR_INTEN_TRIGGERED17_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED17_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED18 @Bit 18 : Enable or disable interrupt for event TRIGGERED[18] */
  #define VPR_INTEN_TRIGGERED18_Pos (18UL)           /*!< Position of TRIGGERED18 field.                                       */
  #define VPR_INTEN_TRIGGERED18_Msk (0x1UL << VPR_INTEN_TRIGGERED18_Pos) /*!< Bit mask of TRIGGERED18 field.                   */
  #define VPR_INTEN_TRIGGERED18_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED18 field.                           */
  #define VPR_INTEN_TRIGGERED18_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED18 field.                           */
  #define VPR_INTEN_TRIGGERED18_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED18_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED19 @Bit 19 : Enable or disable interrupt for event TRIGGERED[19] */
  #define VPR_INTEN_TRIGGERED19_Pos (19UL)           /*!< Position of TRIGGERED19 field.                                       */
  #define VPR_INTEN_TRIGGERED19_Msk (0x1UL << VPR_INTEN_TRIGGERED19_Pos) /*!< Bit mask of TRIGGERED19 field.                   */
  #define VPR_INTEN_TRIGGERED19_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED19 field.                           */
  #define VPR_INTEN_TRIGGERED19_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED19 field.                           */
  #define VPR_INTEN_TRIGGERED19_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED19_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED20 @Bit 20 : Enable or disable interrupt for event TRIGGERED[20] */
  #define VPR_INTEN_TRIGGERED20_Pos (20UL)           /*!< Position of TRIGGERED20 field.                                       */
  #define VPR_INTEN_TRIGGERED20_Msk (0x1UL << VPR_INTEN_TRIGGERED20_Pos) /*!< Bit mask of TRIGGERED20 field.                   */
  #define VPR_INTEN_TRIGGERED20_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED20 field.                           */
  #define VPR_INTEN_TRIGGERED20_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED20 field.                           */
  #define VPR_INTEN_TRIGGERED20_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED20_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED21 @Bit 21 : Enable or disable interrupt for event TRIGGERED[21] */
  #define VPR_INTEN_TRIGGERED21_Pos (21UL)           /*!< Position of TRIGGERED21 field.                                       */
  #define VPR_INTEN_TRIGGERED21_Msk (0x1UL << VPR_INTEN_TRIGGERED21_Pos) /*!< Bit mask of TRIGGERED21 field.                   */
  #define VPR_INTEN_TRIGGERED21_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED21 field.                           */
  #define VPR_INTEN_TRIGGERED21_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED21 field.                           */
  #define VPR_INTEN_TRIGGERED21_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED21_Enabled (0x1UL)      /*!< Enable                                                               */

/* TRIGGERED22 @Bit 22 : Enable or disable interrupt for event TRIGGERED[22] */
  #define VPR_INTEN_TRIGGERED22_Pos (22UL)           /*!< Position of TRIGGERED22 field.                                       */
  #define VPR_INTEN_TRIGGERED22_Msk (0x1UL << VPR_INTEN_TRIGGERED22_Pos) /*!< Bit mask of TRIGGERED22 field.                   */
  #define VPR_INTEN_TRIGGERED22_Min (0x0UL)          /*!< Min enumerator value of TRIGGERED22 field.                           */
  #define VPR_INTEN_TRIGGERED22_Max (0x1UL)          /*!< Max enumerator value of TRIGGERED22 field.                           */
  #define VPR_INTEN_TRIGGERED22_Disabled (0x0UL)     /*!< Disable                                                              */
  #define VPR_INTEN_TRIGGERED22_Enabled (0x1UL)      /*!< Enable                                                               */


/* VPR_INTENSET: Enable interrupt */
  #define VPR_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* TRIGGERED16 @Bit 16 : Write '1' to enable interrupt for event TRIGGERED[16] */
  #define VPR_INTENSET_TRIGGERED16_Pos (16UL)        /*!< Position of TRIGGERED16 field.                                       */
  #define VPR_INTENSET_TRIGGERED16_Msk (0x1UL << VPR_INTENSET_TRIGGERED16_Pos) /*!< Bit mask of TRIGGERED16 field.             */
  #define VPR_INTENSET_TRIGGERED16_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED16 field.                           */
  #define VPR_INTENSET_TRIGGERED16_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED16 field.                           */
  #define VPR_INTENSET_TRIGGERED16_Set (0x1UL)       /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED16_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED16_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED17 @Bit 17 : Write '1' to enable interrupt for event TRIGGERED[17] */
  #define VPR_INTENSET_TRIGGERED17_Pos (17UL)        /*!< Position of TRIGGERED17 field.                                       */
  #define VPR_INTENSET_TRIGGERED17_Msk (0x1UL << VPR_INTENSET_TRIGGERED17_Pos) /*!< Bit mask of TRIGGERED17 field.             */
  #define VPR_INTENSET_TRIGGERED17_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED17 field.                           */
  #define VPR_INTENSET_TRIGGERED17_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED17 field.                           */
  #define VPR_INTENSET_TRIGGERED17_Set (0x1UL)       /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED17_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED17_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* TRIGGERED18 @Bit 18 : Write '1' to enable interrupt for event TRIGGERED[18] */
  #define VPR_INTENSET_TRIGGERED18_Pos (18UL)        /*!< Position of TRIGGERED18 field.                                       */
  #define VPR_INTENSET_TRIGGERED18_Msk (0x1UL << VPR_INTENSET_TRIGGERED18_Pos) /*!< Bit mask of TRIGGERED18 field.             */
  #define VPR_INTENSET_TRIGGERED18_Min (0x0UL)       /*!< Min enumerator value of TRIGGERED18 field.                           */
  #define VPR_INTENSET_TRIGGERED18_Max (0x1UL)       /*!< Max enumerator value of TRIGGERED18 field.                           */
  #define VPR_INTENSET_TRIGGERED18_Set (0x1UL)       /*!< Enable                                                               */
  #define VPR_INTENSET_TRIGGERED18_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define VPR_INTENSET_TRIGGERED18_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

