NordicSemiconductor/nrfx/mdk/nrf54lv10a_enga_types.h
/* EVENTS7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS7_Pos (7UL)     /*!< Position of EVENTS7 field.                                           */
  #define VPRCSR_NORDIC_EVENTS_EVENTS7_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS7_Pos) /*!< Bit mask of EVENTS7 field.         */
  #define VPRCSR_NORDIC_EVENTS_EVENTS7_Min (0x0UL)   /*!< Min enumerator value of EVENTS7 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS7_Max (0x1UL)   /*!< Max enumerator value of EVENTS7 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS7_Disabled (0x0UL) /*!< EVENTS[7] disabled                                                */
  #define VPRCSR_NORDIC_EVENTS_EVENTS7_Enabled (0x1UL) /*!< EVENTS[7] enabled                                                  */

/* EVENTS8 @Bit 8 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS8_Pos (8UL)     /*!< Position of EVENTS8 field.                                           */
  #define VPRCSR_NORDIC_EVENTS_EVENTS8_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS8_Pos) /*!< Bit mask of EVENTS8 field.         */
  #define VPRCSR_NORDIC_EVENTS_EVENTS8_Min (0x0UL)   /*!< Min enumerator value of EVENTS8 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS8_Max (0x1UL)   /*!< Max enumerator value of EVENTS8 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS8_Disabled (0x0UL) /*!< EVENTS[8] disabled                                                */
  #define VPRCSR_NORDIC_EVENTS_EVENTS8_Enabled (0x1UL) /*!< EVENTS[8] enabled                                                  */

/* EVENTS9 @Bit 9 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS9_Pos (9UL)     /*!< Position of EVENTS9 field.                                           */
  #define VPRCSR_NORDIC_EVENTS_EVENTS9_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS9_Pos) /*!< Bit mask of EVENTS9 field.         */
  #define VPRCSR_NORDIC_EVENTS_EVENTS9_Min (0x0UL)   /*!< Min enumerator value of EVENTS9 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS9_Max (0x1UL)   /*!< Max enumerator value of EVENTS9 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS9_Disabled (0x0UL) /*!< EVENTS[9] disabled                                                */
  #define VPRCSR_NORDIC_EVENTS_EVENTS9_Enabled (0x1UL) /*!< EVENTS[9] enabled                                                  */

/* EVENTS10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS10_Pos (10UL)   /*!< Position of EVENTS10 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS10_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS10_Pos) /*!< Bit mask of EVENTS10 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS10_Min (0x0UL)  /*!< Min enumerator value of EVENTS10 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS10_Max (0x1UL)  /*!< Max enumerator value of EVENTS10 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS10_Disabled (0x0UL) /*!< EVENTS[10] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS10_Enabled (0x1UL) /*!< EVENTS[10] enabled                                                */

/* EVENTS11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS11_Pos (11UL)   /*!< Position of EVENTS11 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS11_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS11_Pos) /*!< Bit mask of EVENTS11 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS11_Min (0x0UL)  /*!< Min enumerator value of EVENTS11 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS11_Max (0x1UL)  /*!< Max enumerator value of EVENTS11 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS11_Disabled (0x0UL) /*!< EVENTS[11] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS11_Enabled (0x1UL) /*!< EVENTS[11] enabled                                                */

/* EVENTS12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS12_Pos (12UL)   /*!< Position of EVENTS12 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS12_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS12_Pos) /*!< Bit mask of EVENTS12 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS12_Min (0x0UL)  /*!< Min enumerator value of EVENTS12 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS12_Max (0x1UL)  /*!< Max enumerator value of EVENTS12 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS12_Disabled (0x0UL) /*!< EVENTS[12] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS12_Enabled (0x1UL) /*!< EVENTS[12] enabled                                                */

/* EVENTS13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS13_Pos (13UL)   /*!< Position of EVENTS13 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS13_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS13_Pos) /*!< Bit mask of EVENTS13 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS13_Min (0x0UL)  /*!< Min enumerator value of EVENTS13 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS13_Max (0x1UL)  /*!< Max enumerator value of EVENTS13 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS13_Disabled (0x0UL) /*!< EVENTS[13] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS13_Enabled (0x1UL) /*!< EVENTS[13] enabled                                                */

/* EVENTS14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS14_Pos (14UL)   /*!< Position of EVENTS14 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS14_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS14_Pos) /*!< Bit mask of EVENTS14 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS14_Min (0x0UL)  /*!< Min enumerator value of EVENTS14 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS14_Max (0x1UL)  /*!< Max enumerator value of EVENTS14 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS14_Disabled (0x0UL) /*!< EVENTS[14] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS14_Enabled (0x1UL) /*!< EVENTS[14] enabled                                                */

/* EVENTS15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS15_Pos (15UL)   /*!< Position of EVENTS15 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS15_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS15_Pos) /*!< Bit mask of EVENTS15 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS15_Min (0x0UL)  /*!< Min enumerator value of EVENTS15 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS15_Max (0x1UL)  /*!< Max enumerator value of EVENTS15 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS15_Disabled (0x0UL) /*!< EVENTS[15] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS15_Enabled (0x1UL) /*!< EVENTS[15] enabled                                                */

/* EVENTS16 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS16_Pos (16UL)   /*!< Position of EVENTS16 field.                                          */
  #define VPRCSR_NORDIC_EVENTS_EVENTS16_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS16_Pos) /*!< Bit mask of EVENTS16 field.      */
  #define VPRCSR_NORDIC_EVENTS_EVENTS16_Min (0x0UL)  /*!< Min enumerator value of EVENTS16 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS16_Max (0x1UL)  /*!< Max enumerator value of EVENTS16 field.                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS16_Disabled (0x0UL) /*!< EVENTS[16] disabled                                              */
  #define VPRCSR_NORDIC_EVENTS_EVENTS16_Enabled (0x1UL) /*!< EVENTS[16] enabled                                                */

