NordicSemiconductor/nrfx/mdk/nrf54lv10a_enga_types.h
/* INTEN17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN17_Pos (17UL)     /*!< Position of INTEN17 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN17_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN17_Pos) /*!< Bit mask of INTEN17 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN17_Min (0x0UL)    /*!< Min enumerator value of INTEN17 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN17_Max (0x1UL)    /*!< Max enumerator value of INTEN17 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN17_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[17]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN17_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[17]                                    */

/* INTEN18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN18_Pos (18UL)     /*!< Position of INTEN18 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN18_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN18_Pos) /*!< Bit mask of INTEN18 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN18_Min (0x0UL)    /*!< Min enumerator value of INTEN18 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN18_Max (0x1UL)    /*!< Max enumerator value of INTEN18 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN18_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[18]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN18_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[18]                                    */

/* INTEN19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN19_Pos (19UL)     /*!< Position of INTEN19 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN19_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN19_Pos) /*!< Bit mask of INTEN19 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN19_Min (0x0UL)    /*!< Min enumerator value of INTEN19 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN19_Max (0x1UL)    /*!< Max enumerator value of INTEN19 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN19_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[19]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN19_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[19]                                    */

/* INTEN20 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN20_Pos (20UL)     /*!< Position of INTEN20 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN20_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN20_Pos) /*!< Bit mask of INTEN20 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN20_Min (0x0UL)    /*!< Min enumerator value of INTEN20 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN20_Max (0x1UL)    /*!< Max enumerator value of INTEN20 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN20_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[20]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN20_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[20]                                    */

/* INTEN21 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN21_Pos (21UL)     /*!< Position of INTEN21 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN21_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN21_Pos) /*!< Bit mask of INTEN21 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN21_Min (0x0UL)    /*!< Min enumerator value of INTEN21 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN21_Max (0x1UL)    /*!< Max enumerator value of INTEN21 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN21_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[21]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN21_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[21]                                    */

/* INTEN22 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN22_Pos (22UL)     /*!< Position of INTEN22 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN22_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN22_Pos) /*!< Bit mask of INTEN22 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN22_Min (0x0UL)    /*!< Min enumerator value of INTEN22 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN22_Max (0x1UL)    /*!< Max enumerator value of INTEN22 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN22_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[22]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN22_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[22]                                    */

/* INTEN23 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN23_Pos (23UL)     /*!< Position of INTEN23 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN23_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN23_Pos) /*!< Bit mask of INTEN23 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN23_Min (0x0UL)    /*!< Min enumerator value of INTEN23 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN23_Max (0x1UL)    /*!< Max enumerator value of INTEN23 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN23_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[23]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN23_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[23]                                    */

/* INTEN24 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN24_Pos (24UL)     /*!< Position of INTEN24 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN24_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN24_Pos) /*!< Bit mask of INTEN24 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN24_Min (0x0UL)    /*!< Min enumerator value of INTEN24 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN24_Max (0x1UL)    /*!< Max enumerator value of INTEN24 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN24_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[24]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN24_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[24]                                    */

/* INTEN25 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN25_Pos (25UL)     /*!< Position of INTEN25 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN25_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN25_Pos) /*!< Bit mask of INTEN25 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN25_Min (0x0UL)    /*!< Min enumerator value of INTEN25 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN25_Max (0x1UL)    /*!< Max enumerator value of INTEN25 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN25_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[25]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN25_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[25]                                    */

