NordicSemiconductor/nrfx/mdk/nrf54lv10a_enga_types.h
/* VIOANY @Bit 3 : Interrupt enable for IEVENTVIOANY */
  #define VPRCSR_NORDIC_RTPINTEN_VIOANY_Pos (3UL)    /*!< Position of VIOANY field.                                            */
  #define VPRCSR_NORDIC_RTPINTEN_VIOANY_Msk (0x1UL << VPRCSR_NORDIC_RTPINTEN_VIOANY_Pos) /*!< Bit mask of VIOANY field.        */

/* VTASKSANY @Bit 4 : Interrupt enable for IEVENTVTASKSANY */
  #define VPRCSR_NORDIC_RTPINTEN_VTASKSANY_Pos (4UL) /*!< Position of VTASKSANY field.                                         */
  #define VPRCSR_NORDIC_RTPINTEN_VTASKSANY_Msk (0x1UL << VPRCSR_NORDIC_RTPINTEN_VTASKSANY_Pos) /*!< Bit mask of VTASKSANY
                                                                            field.*/

/* SHIFTCNTOUT @Bit 5 : Interrupt enable for IEVENTSHIFTCNTOUT */
  #define VPRCSR_NORDIC_RTPINTEN_SHIFTCNTOUT_Pos (5UL) /*!< Position of SHIFTCNTOUT field.                                     */
  #define VPRCSR_NORDIC_RTPINTEN_SHIFTCNTOUT_Msk (0x1UL << VPRCSR_NORDIC_RTPINTEN_SHIFTCNTOUT_Pos) /*!< Bit mask of SHIFTCNTOUT
                                                                            field.*/

/* SHIFTCNTIN @Bit 6 : Interrupt enable for IEVENTSHIFTCNTIN */
  #define VPRCSR_NORDIC_RTPINTEN_SHIFTCNTIN_Pos (6UL) /*!< Position of SHIFTCNTIN field.                                       */
  #define VPRCSR_NORDIC_RTPINTEN_SHIFTCNTIN_Msk (0x1UL << VPRCSR_NORDIC_RTPINTEN_SHIFTCNTIN_Pos) /*!< Bit mask of SHIFTCNTIN
                                                                            field.*/


/**
  * @brief OUTUBTRIG [VPRCSR_NORDIC_OUTUBTRIG] OUTUB trigger select
  */
  #define VPRCSR_NORDIC_OUTUBTRIG (0x00000BECul)
  #define VPRCSR_NORDIC_OUTUBTRIG_ResetValue (0x00000000UL) /*!< Reset value of OUTUBTRIG register.                            */

/* SEL @Bits 0..2 : OUTUBTRIG select */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_Pos (0UL)      /*!< Position of SEL field.                                               */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_Msk (0x7UL << VPRCSR_NORDIC_OUTUBTRIG_SEL_Pos) /*!< Bit mask of SEL field.               */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_Min (0x0UL)    /*!< Min enumerator value of SEL field.                                   */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_Max (0x6UL)    /*!< Max enumerator value of SEL field.                                   */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_IEVENTSHIFTCNTIN (0x6UL) /*!< (unspecified)                                              */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_IEVENTSHIFTCNTOUT (0x5UL) /*!< (unspecified)                                             */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_IEVENTVTASKSANY (0x4UL) /*!< (unspecified)                                               */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_IEVENTVIOANY (0x3UL) /*!< (unspecified)                                                  */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_IEVENTVIO (0x2UL) /*!< (unspecified)                                                     */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_IEVENTCNT1 (0x1UL) /*!< (unspecified)                                                    */
  #define VPRCSR_NORDIC_OUTUBTRIG_SEL_IEVENTCNT0 (0x0UL) /*!< (unspecified)                                                    */




/* =========================================================================================================================== */
/* ================                                            WDT                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct WDT ======================================================== */
/**
  * @brief Watchdog Timer
  */
  typedef struct {                                   /*!< WDT Structure                                                        */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start WDT                                             */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop WDT                                              */
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_TIMEOUT;                   /*!< (@ 0x00000100) Watchdog timeout                                      */
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000104) Watchdog stopped                                      */
    __IM uint32_t RESERVED2[30];
    __IOM uint32_t PUBLISH_TIMEOUT;                  /*!< (@ 0x00000180) Publish configuration for event TIMEOUT               */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000184) Publish configuration for event STOPPED               */
    __IM uint32_t RESERVED3[95];
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED4[6];
    __IOM uint32_t NMIENSET;                         /*!< (@ 0x00000324) Enable interrupt                                      */
    __IOM uint32_t NMIENCLR;                         /*!< (@ 0x00000328) Disable interrupt                                     */
    __IM uint32_t RESERVED5[53];
    __IM uint32_t RUNSTATUS;                         /*!< (@ 0x00000400) Run status                                            */
    __IM uint32_t REQSTATUS;                         /*!< (@ 0x00000404) Request status                                        */
    __IM uint32_t RESERVED6[63];
    __IOM uint32_t CRV;                              /*!< (@ 0x00000504) Counter reload value                                  */
    __IOM uint32_t RREN;                             /*!< (@ 0x00000508) Enable register for reload request registers          */
    __IOM uint32_t CONFIG;                           /*!< (@ 0x0000050C) Configuration register                                */
    __IM uint32_t RESERVED7[4];
    __OM uint32_t TSEN;                              /*!< (@ 0x00000520) Task stop enable                                      */
    __IM uint32_t RESERVED8[55];
    __OM uint32_t RR[8];                             /*!< (@ 0x00000600) Reload request n                                      */
  } NRF_WDT_Type;                                    /*!< Size = 1568 (0x620)                                                  */

